In [0]:
import numpy as np
import pandas as pd

from pandas import Series, DataFrame

## pd.DataFrame.add() examples

In [0]:
np.random.seed(25)

In [3]:
df = pd.DataFrame(np.random.rand(10, 3), columns = ['A', 'B', 'C'])

df

          A         B         C
0  0.870124  0.582277  0.278839
1  0.185911  0.411100  0.117376
2  0.684969  0.437611  0.556229
3  0.367080  0.402366  0.113041
4  0.447031  0.585445  0.161985
5  0.520719  0.326051  0.699186
6  0.366395  0.836375  0.481343
7  0.516502  0.383048  0.997541
8  0.514244  0.559053  0.034450
9  0.719930  0.421004  0.436935

In [4]:
df.iloc[-1] = np.nan

df

          A         B         C
0  0.870124  0.582277  0.278839
1  0.185911  0.411100  0.117376
2  0.684969  0.437611  0.556229
3  0.367080  0.402366  0.113041
4  0.447031  0.585445  0.161985
5  0.520719  0.326051  0.699186
6  0.366395  0.836375  0.481343
7  0.516502  0.383048  0.997541
8  0.514244  0.559053  0.034450
9       NaN       NaN       NaN

In [5]:
# add 1 to all the elements of df

df.add(1)

          A         B         C
0  1.870124  1.582277  1.278839
1  1.185911  1.411100  1.117376
2  1.684969  1.437611  1.556229
3  1.367080  1.402366  1.113041
4  1.447031  1.585445  1.161985
5  1.520719  1.326051  1.699186
6  1.366395  1.836375  1.481343
7  1.516502  1.383048  1.997541
8  1.514244  1.559053  1.034450
9       NaN       NaN       NaN

In [6]:
df.add(1, fill_value = 10)

           A          B          C
0   1.870124   1.582277   1.278839
1   1.185911   1.411100   1.117376
2   1.684969   1.437611   1.556229
3   1.367080   1.402366   1.113041
4   1.447031   1.585445   1.161985
5   1.520719   1.326051   1.699186
6   1.366395   1.836375   1.481343
7   1.516502   1.383048   1.997541
8   1.514244   1.559053   1.034450
9  11.000000  11.000000  11.000000

In [7]:
tk = pd.Series(np.ones(10))

tk

0    1.0
1    1.0
2    1.0
3    1.0
4    1.0
5    1.0
6    1.0
7    1.0
8    1.0
9    1.0
dtype: float64

In [8]:
# adding tk to df along index axis

df.add(tk, axis = 'index')

          A         B         C
0  1.870124  1.582277  1.278839
1  1.185911  1.411100  1.117376
2  1.684969  1.437611  1.556229
3  1.367080  1.402366  1.113041
4  1.447031  1.585445  1.161985
5  1.520719  1.326051  1.699186
6  1.366395  1.836375  1.481343
7  1.516502  1.383048  1.997541
8  1.514244  1.559053  1.034450
9       NaN       NaN       NaN

In [9]:
np.random.seed(10)

df2 = pd.DataFrame(np.random.rand(5, 5),
                   columns = ['A', 'B', 'C', 'D', 'E'])

df2

          A         B         C         D         E
0  0.771321  0.020752  0.633648  0.748804  0.498507
1  0.224797  0.198063  0.760531  0.169111  0.088340
2  0.685360  0.953393  0.003948  0.512192  0.812621
3  0.612526  0.721755  0.291876  0.917774  0.714576
4  0.542544  0.142170  0.373341  0.674134  0.441833

In [10]:
df.add(df2)

          A         B         C   D   E
0  1.641445  0.603029  0.912487 NaN NaN
1  0.410708  0.609163  0.877906 NaN NaN
2  1.370329  1.391004  0.560178 NaN NaN
3  0.979606  1.124121  0.404917 NaN NaN
4  0.989575  0.727615  0.535326 NaN NaN
5       NaN       NaN       NaN NaN NaN
6       NaN       NaN       NaN NaN NaN
7       NaN       NaN       NaN NaN NaN
8       NaN       NaN       NaN NaN NaN
9       NaN       NaN       NaN NaN NaN

In [11]:
df.add(df2, fill_value = 10)

           A          B          C          D          E
0   1.641445   0.603029   0.912487  10.748804  10.498507
1   0.410708   0.609163   0.877906  10.169111  10.088340
2   1.370329   1.391004   0.560178  10.512192  10.812621
3   0.979606   1.124121   0.404917  10.917774  10.714576
4   0.989575   0.727615   0.535326  10.674134  10.441833
5  10.520719  10.326051  10.699186        NaN        NaN
6  10.366395  10.836375  10.481343        NaN        NaN
7  10.516502  10.383048  10.997541        NaN        NaN
8  10.514244  10.559053  10.034450        NaN        NaN
9        NaN        NaN        NaN        NaN        NaN

## pd.DataFrame.radd() examples

In [12]:
df = pd.DataFrame({"A": [1, 5, 3, 4, 2],
                   "B": [3, 2, 4, 3, 4],
                   "C": [2, 2, 7, 3, 4],
                   "D": [4, 3, 6, 12, 7]})

df

   A  B  C   D
0  1  3  2   4
1  5  2  2   3
2  3  4  7   6
3  4  3  3  12
4  2  4  4   7

In [13]:
sr = pd.Series([5, 10, 15, 20], index = ["A", "B", "C", "D"])

sr

A     5
B    10
C    15
D    20
dtype: int64

In [14]:
df.radd(sr, axis = 1)

    A   B   C   D
0   6  13  17  24
1  10  12  17  23
2   8  14  22  26
3   9  13  18  32
4   7  14  19  27

In [15]:
df1 = pd.DataFrame({"A": [1, 5, 3, 4, 2],
                    "B": [3, 2, 4, 3, 4],
                    "C": [2, 2, 7, 3, 4],
                    "D": [4, 3, 6, 12, 7]})

df2 = pd.DataFrame({"A": [14, 5, None, 4, 12],
                    "B": [7, 6, 4, 5, None],
                    "C": [2, 11, 4, 3, 6],
                    "D": [4, None, 6, 2, 4]})

df1.radd(df2, fill_value = 100)

       A      B   C      D
0   15.0   10.0   4    8.0
1   10.0    8.0  13  103.0
2  103.0    8.0  11   12.0
3    8.0    8.0   6   14.0
4   14.0  104.0  10   11.0

## pd.DataFrame.sub() examples

In [16]:
df = pd.DataFrame({"A": [1, 5, 3, 4, 2],
                   "B": [3, 2, 4, 3, 4],
                   "C": [2, 2, 7, 3, 4],
                   "D": [4, 3, 6, 12, 7]},
                  index = ["A1", "A2", "A3", "A4", "A5"])

df

    A  B  C   D
A1  1  3  2   4
A2  5  2  2   3
A3  3  4  7   6
A4  4  3  3  12
A5  2  4  4   7

In [17]:
sr = pd.Series([12, 25, 64, 18], index = ["A", "B", "C", "D"])

sr

A    12
B    25
C    64
D    18
dtype: int64

In [18]:
df.sub(sr, axis = 1)

     A   B   C   D
A1 -11 -22 -62 -14
A2  -7 -23 -62 -15
A3  -9 -21 -57 -12
A4  -8 -22 -61  -6
A5 -10 -21 -60 -11

In [19]:
df2 = pd.DataFrame({"A": [10, 11, 7, 8, 5],
                    "B": [21, 5, 32, 4, 6],
                    "C": [11, 21, 23, 7, 9],
                    "D": [1, 5, 3, 8, 6]},
                   index = ["A1", "A2", "A3", "A4", "A5"])

df.sub(df2)

    A   B   C  D
A1 -9 -18  -9  3
A2 -6  -3 -19 -2
A3 -4 -28 -16  3
A4 -4  -1  -4  4
A5 -3  -2  -5  1

## pd.DataFrame.rsub() examples

In [20]:
df = pd.DataFrame({"A": [1, 5, 3, 4, 2],
                   "B": [3, 2, 4, 3, 4],
                   "C": [2, 2, 7, 3, 4],
                   "D": [4, 3, 6, 12, 7]},
                  index = ["A1", "A2", "A3", "A4", "A5"])

df

    A  B  C   D
A1  1  3  2   4
A2  5  2  2   3
A3  3  4  7   6
A4  4  3  3  12
A5  2  4  4   7

In [21]:
sr = pd.Series([12, 25, 64, 18], index = ["A", "B", "C", "D"])

sr

A    12
B    25
C    64
D    18
dtype: int64

In [22]:
df.rsub(sr, axis = 1) # equivalent to sr - df

     A   B   C   D
A1  11  22  62  14
A2   7  23  62  15
A3   9  21  57  12
A4   8  22  61   6
A5  10  21  60  11

In [23]:
df2 = pd.DataFrame({"A": [10, 11, 7, 8, 5],
                    "B": [21, 5, 32, 4, 6],
                    "C": [11, 21, 23, 7, 9],
                    "D": [1, 5, 3, 8, 6]},
                   index = ["A1", "A2", "A3", "A4", "A5"])

df.rsub(df2) # df2 - df

    A   B   C  D
A1  9  18   9 -3
A2  6   3  19  2
A3  4  28  16 -3
A4  4   1   4 -4
A5  3   2   5 -1

## pd.DataFrame.div() examples

In [24]:
df = pd.DataFrame({"A": [5, 3, None, 4],
                   "B": [None, 2, 4, 3],
                   "C": [4, 3, 8, 5],
                   "D": [5, 4, 2, None]})

df

     A    B  C    D
0  5.0  NaN  4  5.0
1  3.0  2.0  3  4.0
2  NaN  4.0  8  2.0
3  4.0  3.0  5  NaN

In [25]:
df.div(2, fill_value = 50)

      A     B    C     D
0   2.5  25.0  2.0   2.5
1   1.5   1.0  1.5   2.0
2  25.0   2.0  4.0   1.0
3   2.0   1.5  2.5  25.0

In [26]:
df = pd.DataFrame({"A": [5, 3, 6, 4],
                   "B": [11, 2, 4, 3],
                   "C": [4, 3, 8, 5],
                   "D": [5, 4, 2, 8]})

series_object = pd.Series([2, 3, 1.5, 4])

series_object

0    2.0
1    3.0
2    1.5
3    4.0
dtype: float64

In [27]:
df.div(series_object, axis = 0)

     A         B         C         D
0  2.5  5.500000  2.000000  2.500000
1  1.0  0.666667  1.000000  1.333333
2  4.0  2.666667  5.333333  1.333333
3  1.0  0.750000  1.250000  2.000000

## pd.DataFrame.rdiv() examples

In [28]:
df = pd.DataFrame({"A": [1, 5, 3, 4, 2],
                   "B": [3, 2, 4, 3, 4],
                   "C": [2, 2, 7, 3, 4],
                   "D": [4, 3, 6, 12, 7]})
df

   A  B  C   D
0  1  3  2   4
1  5  2  2   3
2  3  4  7   6
3  4  3  3  12
4  2  4  4   7

In [29]:
sr = pd.Series([5, 10, 15, 20], index = ["A", "B", "C", "D"])

sr

A     5
B    10
C    15
D    20
dtype: int64

In [30]:
df.rdiv(sr, axis = 1)

          A         B         C         D
0  5.000000  3.333333  7.500000  5.000000
1  1.000000  5.000000  7.500000  6.666667
2  1.666667  2.500000  2.142857  3.333333
3  1.250000  3.333333  5.000000  1.666667
4  2.500000  2.500000  3.750000  2.857143

In [31]:
df2 = pd.DataFrame({"A": [14, 5, None, 4, 12],
                    "B": [7, 6, 4, 5, None],
                    "C": [2, 11, 4, 3, 6],
                    "D": [4, None, 6, 2, 4]})

df2

      A    B   C    D
0  14.0  7.0   2  4.0
1   5.0  6.0  11  NaN
2   NaN  4.0   4  6.0
3   4.0  5.0   3  2.0
4  12.0  NaN   6  4.0

In [32]:
df.rdiv(df2, fill_value = 100)

           A          B         C          D
0  14.000000   2.333333  1.000000   1.000000
1   1.000000   3.000000  5.500000  33.333333
2  33.333333   1.000000  0.571429   1.000000
3   1.000000   1.666667  1.000000   0.166667
4   6.000000  25.000000  1.500000   0.571429

## pd.DataFrame.floordiv() examples

In [33]:
df = pd.DataFrame({"A": [5, 3, 6, 4],
                   "B": [11, None, 4, 3],
                   "C": [4, 3, 8, None],
                   "D": [5, 4, 2, 8]})

df

   A     B    C  D
0  5  11.0  4.0  5
1  3   NaN  3.0  4
2  6   4.0  8.0  2
3  4   3.0  NaN  8

In [34]:
df.floordiv(2, fill_value = 50)

   A     B     C  D
0  2   5.0   2.0  2
1  1  25.0   1.0  2
2  3   2.0   4.0  1
3  2   1.0  25.0  4

In [35]:
df = pd.DataFrame({"A": [5, 3, 6, 4],
                   "B": [11, 2, 4, 3],
                   "C": [4, 3, 8, 5],
                   "D": [5, 4, 2, 8]})

df

   A   B  C  D
0  5  11  4  5
1  3   2  3  4
2  6   4  8  2
3  4   3  5  8

In [36]:
sr = pd.Series([2, 1, 3, 1])

sr

0    2
1    1
2    3
3    1
dtype: int64

In [37]:
df.floordiv(sr, axis = 0)

   A  B  C  D
0  2  5  2  2
1  3  2  3  4
2  2  1  2  0
3  4  3  5  8

## pd.DataFrame.rfloordiv() examples

In [38]:
df = pd.DataFrame({"A": [1, 5, 3, 4, 2],
                   "B": [3, 2, 4, 3, 4],
                   "C": [2, 2, 7, 3, 4],
                   "D": [4, 3, 6, 12, 7]},
                  index = ["A1", "A2", "A3", "A4", "A5"])

df

    A  B  C   D
A1  1  3  2   4
A2  5  2  2   3
A3  3  4  7   6
A4  4  3  3  12
A5  2  4  4   7

In [39]:
sr = pd.Series([12, 25, 64, 18],
               index = ["A", "B", "C", "D"])

sr

A    12
B    25
C    64
D    18
dtype: int64

In [40]:
df.rfloordiv(sr, axis = 1)

     A   B   C  D
A1  12   8  32  4
A2   2  12  32  6
A3   4   6   9  3
A4   3   8  21  1
A5   6   6  16  2

In [41]:
df2 = pd.DataFrame({"A": [10, 11, 7, 8, 5],
                    "B": [21, 5, 32, 4, 6],
                    "C": [11, 21, 23, 7, 9],
                    "D": [1, 5, 3, 8, 6]},
                   index = ["A1", "A2", "A3", "A4", "A5"])

df2

     A   B   C  D
A1  10  21  11  1
A2  11   5  21  5
A3   7  32  23  3
A4   8   4   7  8
A5   5   6   9  6

In [42]:
df.rfloordiv(df2) # df2 // df

     A  B   C  D
A1  10  7   5  0
A2   2  2  10  1
A3   2  8   3  0
A4   2  1   2  0
A5   2  1   2  0

## pd.DataFrame.mul() examples

In [43]:
df1 = pd.DataFrame({"A": [14, 4, 5, 4, 1],
                    "B": [5, 2, 54, 3, 2],
                    "C": [20, 20, 7, 3, 8],
                    "D": [14, 3, 6, 2, 6]})

df1

    A   B   C   D
0  14   5  20  14
1   4   2  20   3
2   5  54   7   6
3   4   3   3   2
4   1   2   8   6

In [44]:
sr = pd.Series([3, 2, 4, 5, 6])

sr

0    3
1    2
2    4
3    5
4    6
dtype: int64

In [45]:
df1.mul(sr, axis = 0)

    A    B   C   D
0  42   15  60  42
1   8    4  40   6
2  20  216  28  24
3  20   15  15  10
4   6   12  48  36

In [46]:
df2 = pd.DataFrame({"A": [12, 4, 5, None, 1],
                    "B": [7, 2, 54, 3, None],
                    "C": [20, 16, 11, 3, 8],
                    "D": [14, 3, None, 2, 6]})

df2

      A     B   C     D
0  12.0   7.0  20  14.0
1   4.0   2.0  16   3.0
2   5.0  54.0  11   NaN
3   NaN   3.0   3   2.0
4   1.0   NaN   8   6.0

In [47]:
df1.mul(df2, fill_value = 100)

       A       B    C      D
0  168.0    35.0  400  196.0
1   16.0     4.0  320    9.0
2   25.0  2916.0   77  600.0
3  400.0     9.0    9    4.0
4    1.0   200.0   64   36.0

## pd.DataFrame.rmul() examples

In [48]:
df = pd.DataFrame({"A": [1, 5, 3, 4, 2],
                   "B": [3, 2, 4, 3, 4],
                   "C": [2, 2, 7, 3, 4],
                   "D": [4, 3, 6, 12, 7]},
                  index = ["A1", "A2", "A3", "A4", "A5"])

df

    A  B  C   D
A1  1  3  2   4
A2  5  2  2   3
A3  3  4  7   6
A4  4  3  3  12
A5  2  4  4   7

In [49]:
sr = pd.Series([12, 25, 64, 18],
               index = ["A", "B", "C", "D"])

sr

A    12
B    25
C    64
D    18
dtype: int64

In [50]:
df.rmul(sr, axis = 1)

     A    B    C    D
A1  12   75  128   72
A2  60   50  128   54
A3  36  100  448  108
A4  48   75  192  216
A5  24  100  256  126

In [51]:
df2 = pd.DataFrame({"A": [10, 11, 7, 8, 5],
                    "B": [21, 5, 32, 4, 6],
                    "C": [11, 21, 23, 7, 9],
                    "D": [1, 5, 3, 8, 6]},
                   index = ["A1", "A2", "A3", "A4", "A5"])

df2

     A   B   C  D
A1  10  21  11  1
A2  11   5  21  5
A3   7  32  23  3
A4   8   4   7  8
A5   5   6   9  6

In [52]:
df.rmul(df2)

     A    B    C   D
A1  10   63   22   4
A2  55   10   42  15
A3  21  128  161  18
A4  32   12   21  96
A5  10   24   36  42

## pd.DataFrame.pow() examples

In [53]:
df1 = pd.DataFrame({"A": [14, 4, 5, 4, 1],
                    "B": [5, 2, 54, 3, 2],
                    "C": [20, 20, 7, 3, 8],
                    "D": [14, 3, 6, 2, 6]})

df1

    A   B   C   D
0  14   5  20  14
1   4   2  20   3
2   5  54   7   6
3   4   3   3   2
4   1   2   8   6

In [54]:
sr = pd.Series([2, 3, 4, 2], index =["A", "B", "C", "D"])

sr

A    2
B    3
C    4
D    2
dtype: int64

In [55]:
df1.pow(sr, axis = 1)

     A       B       C    D
0  196     125  160000  196
1   16       8  160000    9
2   25  157464    2401   36
3   16      27      81    4
4    1       8    4096   36

In [56]:
df2 = pd.DataFrame({"A": [1, 5, 3, 4, 2],
                    "B": [3, 2, 4, 3 ,4],
                    "C": [2, 2, 7, 3, 4],
                    "D": [4, 3, 6, 12, 7]})

df2

   A  B  C   D
0  1  3  2   4
1  5  2  2   3
2  3  4  7   6
3  4  3  3  12
4  2  4  4   7

In [57]:
df1.pow(df2)

      A        B       C       D
0    14      125     400   38416
1  1024        4     400      27
2   125  8503056  823543   46656
3   256       27      27    4096
4     1       16    4096  279936

## pd.DataFrame.rpow() examples

In [58]:
df = pd.DataFrame({"A": [1, 5, 3, 4, 2],
                   "B": [3, 2, 4, 3 ,4],
                   "C": [2, 2, 7, 3, 4],
                   "D": [4, 3, 6, 12, 7]},
                  index = ["A1", "A2", "A3", "A4", "A5"])

df

    A  B  C   D
A1  1  3  2   4
A2  5  2  2   3
A3  3  4  7   6
A4  4  3  3  12
A5  2  4  4   7

In [59]:
sr = pd.Series([12, 25, 64, 18], index = ["A", "B", "C", "D"])

sr

A    12
B    25
C    64
D    18
dtype: int64

In [60]:
df.rpow(sr, axis = 1)  #equivalent to sr ** df

         A       B              C                 D
A1      12   15625           4096            104976
A2  248832     625           4096              5832
A3    1728  390625  4398046511104          34012224
A4   20736   15625         262144  1156831381426176
A5     144  390625       16777216         612220032

In [61]:
df2 = pd.DataFrame({"A": [10, 11, 7, 8, 5],
                    "B": [21, 5, 32, 4, 6],
                    "C": [11, 21, 23, 7, 9],
                    "D": [1, 5, 3, 8, 6]},
                   index = ["A1", "A2", "A3", "A4", "A5"])

df2

     A   B   C  D
A1  10  21  11  1
A2  11   5  21  5
A3   7  32  23  3
A4   8   4   7  8
A5   5   6   9  6

In [62]:
df.rpow(df2) # df2 ** df

         A        B           C            D
A1      10     9261         121            1
A2  161051       25         441          125
A3     343  1048576  3404825447          729
A4    4096       64         343  68719476736
A5      25     1296        6561       279936

## Operations between DataFrame and Series

In [63]:
arr = np.arange(12.).reshape((3, 4))

arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [64]:
arr[0]

array([0., 1., 2., 3.])

In [65]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [66]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns = list('bde'),
                     index = ['Utah', 'Ohio', 'Texas', 'Oregon'])

frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [67]:
series = frame.iloc[0]

series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [68]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [69]:
series2 = pd.Series(range(3), index = ['b', 'e', 'f'])

series2

b    0
e    1
f    2
dtype: int64

In [70]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [71]:
series3 = frame['d']

series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [72]:
frame.sub(series3, axis = 'index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

## Function Application and Mapping

In [73]:
frame = pd.DataFrame(np.random.randn(4, 3), columns = list('bde'),
                     index = ['Utah', 'Ohio', 'Texas', 'Oregon'])

frame

               b         d         e
Utah    1.996523 -1.118672  2.180328
Ohio    0.190467  1.261686  0.417660
Texas   0.893958  0.047355 -0.608426
Oregon -0.268548 -0.666302 -0.344012

In [74]:
np.abs(frame)

               b         d         e
Utah    1.996523  1.118672  2.180328
Ohio    0.190467  1.261686  0.417660
Texas   0.893958  0.047355  0.608426
Oregon  0.268548  0.666302  0.344012

In [0]:
f = lambda x: x.max() - x.min()

In [76]:
frame.apply(f)

b    2.265071
d    2.380357
e    2.788754
dtype: float64

In [77]:
frame.apply(f, axis = 'columns')

Utah      3.299000
Ohio      1.071219
Texas     1.502383
Oregon    0.397754
dtype: float64

In [0]:
def f(x):
  return pd.Series([x.min(), x.max()], index = ['min', 'max'])

In [79]:
frame.apply(f)

            b         d         e
min -0.268548 -1.118672 -0.608426
max  1.996523  1.261686  2.180328

In [80]:
frame.apply(f, axis = 'columns')

             min       max
Utah   -1.118672  2.180328
Ohio    0.190467  1.261686
Texas  -0.608426  0.893958
Oregon -0.666302 -0.268548

In [0]:
format = lambda x: '%.2f' % x

In [82]:
frame.applymap(format)

            b      d      e
Utah     2.00  -1.12   2.18
Ohio     0.19   1.26   0.42
Texas    0.89   0.05  -0.61
Oregon  -0.27  -0.67  -0.34

In [83]:
frame['e'].map(format)

Utah       2.18
Ohio       0.42
Texas     -0.61
Oregon    -0.34
Name: e, dtype: object

## Sorting and Ranking

In [0]:
obj = pd.Series(range(4), index = ['d', 'a', 'b', 'c'])

In [85]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [86]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index = ['three', 'one'],
                     columns = ['d', 'a', 'b', 'c'])

frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [87]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [88]:
frame.sort_index(axis = 1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [89]:
frame.sort_index(axis = 1, ascending = False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [0]:
obj = pd.Series([4, 7, -3, 2])

In [91]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [0]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])

In [93]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [94]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [95]:
frame.sort_values(by = 'b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [96]:
frame.sort_values(by = ['a', 'b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [0]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])

In [98]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [99]:
obj.rank(method = 'first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [100]:
# Assign tie values the maximum rank in the group

obj.rank(ascending = False, method = 'max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [101]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 
                      'a': [0, 1, 0, 1],
                      'c': [-2, 5, 8, -2.5]})

frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [102]:
frame.rank(axis = 'columns')

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

In [0]:
## Check tie - breaking methods with rank such as
## 'average', 'min', 'max', 'first', 'dense'

## Axis Indexes with Duplicate Labels

In [104]:
obj = pd.Series(range(5), index = ['a', 'a', 'b', 'b', 'c'])

obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [105]:
obj.index.is_unique

False

In [106]:
obj['a']

a    0
a    1
dtype: int64

In [107]:
obj['c']

4

In [108]:
df = pd.DataFrame(np.random.randn(4, 3), index = ['a', 'a', 'b', 'b'])

df

          0         1         2
a  0.807052  2.141805 -0.495618
a  0.525637 -0.389646  0.937296
b -0.816974  1.019615 -0.341436
b  0.751281 -0.362252 -1.129131

In [109]:
df.loc['b']

          0         1         2
b -0.816974  1.019615 -0.341436
b  0.751281 -0.362252 -1.129131

# 5.3 Summarizing and Computing Descriptive Statistics

In [110]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index = ['a', 'b', 'c', 'd'],
                  columns = ['one', 'two'])

df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [111]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [112]:
df.sum(axis = 'columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [113]:
df.mean(axis = 'columns', skipna = False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [114]:
df.idxmax()

one    b
two    d
dtype: object

In [115]:
df.idxmin()

one    d
two    b
dtype: object

In [116]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [117]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [118]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)

obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [119]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

## Descriptive and Summary statistics functions

## pd.DataFrame.count()

In [120]:
df = pd.DataFrame({"Person":
                   ["John", "Myla", "Lewis", "John", "Myla"],
                   "Age": [24., np.nan, 21., 33, 26],
                   "Single": [False, True, True, True, False]})

df

    Age Person  Single
0  24.0   John   False
1   NaN   Myla    True
2  21.0  Lewis    True
3  33.0   John    True
4  26.0   Myla   False

In [121]:
df.count()

Age       4
Person    5
Single    5
dtype: int64

In [122]:
df.count(axis = 'columns')

0    3
1    2
2    3
3    3
4    3
dtype: int64

In [123]:
df.set_index(["Person", "Single"]).count(level = "Person")

        Age
Person
John      2
Lewis     1
Myla      1

In [124]:
df = pd.DataFrame({"A": [-5, 8, 12, None, 5, 3],
                   "B": [-1, None, 6, 4, None, 3],
                   "C": ["sam", "haris", "alex", np.nan, "peter",
                         "nathan"]})

df

      A    B       C
0  -5.0 -1.0     sam
1   8.0  NaN   haris
2  12.0  6.0    alex
3   NaN  4.0     NaN
4   5.0  NaN   peter
5   3.0  3.0  nathan

In [125]:
df.count(axis = 0)

A    5
B    4
C    5
dtype: int64

In [126]:
df.count(axis = 1)

0    3
1    2
2    3
3    1
4    2
5    3
dtype: int64

## pd.DataFrame.describe()

In [127]:
s = pd.Series([1, 2, 3])

s.describe()

count    3.0
mean     2.0
std      1.0
min      1.0
25%      1.5
50%      2.0
75%      2.5
max      3.0
dtype: float64

In [128]:
s = pd.Series(['a', 'a', 'b', 'c'])

s.describe()

count     4
unique    3
top       a
freq      2
dtype: object

In [129]:
# timestamp Series

s = pd.Series([
    np.datetime64("2000-01-01"),
    np.datetime64("2010-01-01"),
    np.datetime64("2010-01-01")
])

s.describe()

count                       3
unique                      2
top       2010-01-01 00:00:00
freq                        2
first     2000-01-01 00:00:00
last      2010-01-01 00:00:00
dtype: object

In [130]:
# In a DataFrame, only numeric fields are returned by default

df = pd.DataFrame({'categorical': pd.Categorical(['d', 'e', 'f']),
                   'numeric': [1, 2, 3],
                   'object': ['a', 'b', 'c']
                  })

df.describe()

       numeric
count      3.0
mean       2.0
std        1.0
min        1.0
25%        1.5
50%        2.0
75%        2.5
max        3.0

In [131]:
df.describe(include = 'all')

       categorical  numeric object
count            3      3.0      3
unique           3      NaN      3
top              f      NaN      a
freq             1      NaN      1
mean           NaN      2.0    NaN
std            NaN      1.0    NaN
min            NaN      1.0    NaN
25%            NaN      1.5    NaN
50%            NaN      2.0    NaN
75%            NaN      2.5    NaN
max            NaN      3.0    NaN

In [132]:
df.numeric.describe()

count    3.0
mean     2.0
std      1.0
min      1.0
25%      1.5
50%      2.0
75%      2.5
max      3.0
Name: numeric, dtype: float64

In [133]:
df.describe(include = [np.number])

       numeric
count      3.0
mean       2.0
std        1.0
min        1.0
25%        1.5
50%        2.0
75%        2.5
max        3.0

In [134]:
df.describe(include = [np.object])

       object
count       3
unique      3
top         a
freq        1

In [135]:
df.describe(include = ['category'])

       categorical
count            3
unique           3
top              f
freq             1

In [136]:
df.describe(exclude = [np.number])

       categorical object
count            3      3
unique           3      3
top              f      a
freq             1      1

In [137]:
df.describe(exclude = [np.object])

       categorical  numeric
count            3      3.0
unique           3      NaN
top              f      NaN
freq             1      NaN
mean           NaN      2.0
std            NaN      1.0
min            NaN      1.0
25%            NaN      1.5
50%            NaN      2.0
75%            NaN      2.5
max            NaN      3.0

In [138]:
import re

data = pd.read_csv("https://cdncontribute.geeksforgeeks.org/wp-content/uploads/nba.csv")

data.dropna(inplace = True)

perc = [.20, .40, .60, .80]

include = ['object', 'float', 'int']

desc = data.describe(percentiles = perc, include = include)

desc

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
count,364,364,364.000000,364,364.000000,364,364.000000,364,3.640000e+02
unique,364,30,NaN,5,NaN,17,NaN,115,NaN
top,Isaiah Canaan,New Orleans Pelicans,NaN,SG,NaN,6-9,NaN,Kentucky,NaN
freq,1,16,NaN,87,NaN,49,NaN,22,NaN
mean,NaN,NaN,16.829670,NaN,26.615385,NaN,219.785714,NaN,4.620311e+06
std,NaN,NaN,14.994162,NaN,4.233591,NaN,24.793099,NaN,5.119716e+06
min,NaN,NaN,0.000000,NaN,19.000000,NaN,161.000000,NaN,5.572200e+04
20%,NaN,NaN,4.000000,NaN,23.000000,NaN,195.000000,NaN,9.472760e+05
40%,NaN,NaN,9.000000,NaN,25.000000,NaN,212.000000,NaN,1.638754e+06
50%,NaN,NaN,12.000000,NaN,26.000000,NaN,220.000000,NaN,2.515440e+06
60%,NaN,NaN,17.000000,NaN,27.000000,NaN,228.000000,NaN,3.429934e+06
80%,NaN,NaN,30.000000,NaN,30.000000,NaN,242.400000,NaN,7.838202e+06
max,NaN,NaN,99.000000,NaN,40.000000,NaN,279.000000,NaN,2.287500e+07

In [139]:
import re

data = pd.read_csv("https://cdncontribute.geeksforgeeks.org/wp-content/uploads/nba.csv")

data.dropna(inplace = True)

desc = data["Name"].describe()

desc

count               364
unique              364
top       Isaiah Canaan
freq                  1
Name: Name, dtype: object

## pd.DataFrame.min()

In [140]:
idx = pd.MultiIndex.from_arrays([
    ['warm', 'warm', 'cold', 'cold'],
    ['dog', 'falcon', 'fish', 'spider']],
    names = ['blooded', 'animal']
)

idx

MultiIndex(levels=[['cold', 'warm'], ['dog', 'falcon', 'fish', 'spider']],
           labels=[[1, 1, 0, 0], [0, 1, 2, 3]],
           names=['blooded', 'animal'])

In [141]:
s = pd.Series([4, 2, 0, 8], name = 'legs', index = idx)

s

blooded  animal
warm     dog       4
         falcon    2
cold     fish      0
         spider    8
Name: legs, dtype: int64

In [142]:
s.min()

0

In [143]:
s.min(level = 'blooded')

blooded
warm    2
cold    0
Name: legs, dtype: int64

In [144]:
s.min(level = 0)

blooded
warm    2
cold    0
Name: legs, dtype: int64

In [145]:
df = pd.DataFrame({"A": [12, 4, 5, 44, 1],
                   "B": [5, 2, 54, 3, 2],
                   "C": [20, 16, 7, 3, 8],
                   "D": [14, 3, 17, 2, 6]})

df

    A   B   C   D
0  12   5  20  14
1   4   2  16   3
2   5  54   7  17
3  44   3   3   2
4   1   2   8   6

In [146]:
df.min(axis = 0)

A    1
B    2
C    3
D    2
dtype: int64

In [147]:
df = pd.DataFrame({"A": [12, 4, 5, None, 1],
                   "B": [7, 2, 54, 3, None],
                   "C": [20, 16, 11, 3, 8],
                   "D": [14, 3, None, 2, 6]})

df

      A     B   C     D
0  12.0   7.0  20  14.0
1   4.0   2.0  16   3.0
2   5.0  54.0  11   NaN
3   NaN   3.0   3   2.0
4   1.0   NaN   8   6.0

In [148]:
df.min(axis = 1, skipna = True)

0    7.0
1    2.0
2    5.0
3    2.0
4    1.0
dtype: float64

## pd.DataFrame.max()

In [149]:
idx = pd.MultiIndex.from_arrays([
    ['warm', 'warm', 'cold', 'cold'],
    ['dog', 'falcon', 'fish', 'spider']],
    names = ['blooded', 'animal']
)

idx

MultiIndex(levels=[['cold', 'warm'], ['dog', 'falcon', 'fish', 'spider']],
           labels=[[1, 1, 0, 0], [0, 1, 2, 3]],
           names=['blooded', 'animal'])

In [150]:
s = pd.Series([4, 2, 0, 8], name = 'legs', index = idx)

s

blooded  animal
warm     dog       4
         falcon    2
cold     fish      0
         spider    8
Name: legs, dtype: int64

In [151]:
s.max()

8

In [152]:
s.max(level = 'blooded')

blooded
warm    4
cold    8
Name: legs, dtype: int64

In [153]:
s.max(level = 0)

blooded
warm    4
cold    8
Name: legs, dtype: int64

In [154]:
df = pd.DataFrame({"A": [12, 4, 5, 44, 1],
                   "B": [5, 2, 54, 3, 2],
                   "C": [20, 16, 7, 3, 8],
                   "D": [14, 3, 17, 2, 6]})

df

    A   B   C   D
0  12   5  20  14
1   4   2  16   3
2   5  54   7  17
3  44   3   3   2
4   1   2   8   6

In [155]:
df.max(axis = 0)

A    44
B    54
C    20
D    17
dtype: int64

In [156]:
df.max(axis = 1, skipna = True)

0    20
1    16
2    54
3    44
4     8
dtype: int64

### pd.DataFrame.argmin() and argmax() are deprecated. Use idxmin() and idxmax() instead.

## pd.DataFrame.idxmin()

In [157]:
## See pd.Series.idxmin()

s = pd.Series(data = [1, None, 4, 1],
              index = ['A', 'B', 'C', 'D'])

s

A    1.0
B    NaN
C    4.0
D    1.0
dtype: float64

In [158]:
s.idxmin()

'A'

In [159]:
df = pd.DataFrame({"A": [4, 5, 2 , 6],
                   "B": [11, 2, 5, 8],
                   "C": [1, 8, 66, 4]})

df

   A   B   C
0  4  11   1
1  5   2   8
2  2   5  66
3  6   8   4

In [160]:
df.idxmin(axis = 0)

A    2
B    1
C    0
dtype: int64

In [161]:
df = pd.DataFrame({"A": [4, 5, 2, None],
                   "B": [11, 2, None, 8],
                   "C": [1, 8, 66, 4]})

df

     A     B   C
0  4.0  11.0   1
1  5.0   2.0   8
2  2.0   NaN  66
3  NaN   8.0   4

In [162]:
df.idxmin(axis = 1, skipna = True)

0    C
1    B
2    A
3    C
dtype: object

## pd.DataFrame.idxmax()

In [163]:
## See pd.Series.idxmax()

s = pd.Series(data = [1, None, 4, 3, 4],
              index = ['A', 'B', 'C', 'D', 'E'])

s

A    1.0
B    NaN
C    4.0
D    3.0
E    4.0
dtype: float64

In [164]:
s.idxmax()

'C'

In [165]:
s.idxmax(skipna = False)

nan

In [166]:
df = pd.DataFrame({"A": [4, 5, 2 , 6],
                   "B": [11, 2, 5, 8],
                   "C": [1, 8, 66, 4]})

df

   A   B   C
0  4  11   1
1  5   2   8
2  2   5  66
3  6   8   4

In [167]:
df.idxmax(axis = 0)

A    3
B    0
C    2
dtype: int64

In [168]:
df = pd.DataFrame({"A": [4, 5, 2, None],
                   "B": [11, 2, None, 8],
                   "C": [1, 8, 66, 4]})

df

     A     B   C
0  4.0  11.0   1
1  5.0   2.0   8
2  2.0   NaN  66
3  NaN   8.0   4

In [169]:
df.idxmax(axis = 1, skipna = True)

0    B
1    C
2    C
3    B
dtype: object

## pd.DataFrame.quantile()

In [170]:
df = pd.DataFrame(np.array([[1, 1], [2, 10], [3, 100], [4, 100]]),
                  columns = ['a', 'b'])

df

   a    b
0  1    1
1  2   10
2  3  100
3  4  100

In [171]:
df.quantile(.1)

a    1.3
b    3.7
Name: 0.1, dtype: float64

In [172]:
df.quantile([.1, .5])

       a     b
0.1  1.3   3.7
0.5  2.5  55.0

In [0]:
df = pd.DataFrame({'A': [1, 2],
                   'B': [pd.Timestamp('2010'),
                         pd.Timestamp('2011')],
                   'C': [pd.Timedelta('1 days'),
                         pd.Timedelta('2 days')]})

In [174]:
df.quantile(0.5, numeric_only = False)

A                    1.5
B    2010-07-02 12:00:00
C        1 days 12:00:00
Name: 0.5, dtype: object

In [175]:
df = pd.DataFrame({"A": [1, 5, 3, 4, 2],
                   "B": [3, 2, 4, 3, 4],
                   "C": [2, 2, 7, 3, 4],
                   "D": [4, 3, 6, 12, 7]})

df

   A  B  C   D
0  1  3  2   4
1  5  2  2   3
2  3  4  7   6
3  4  3  3  12
4  2  4  4   7

In [176]:
df.quantile(.2, axis = 0)

A    1.8
B    2.8
C    2.0
D    3.8
Name: 0.2, dtype: float64

In [177]:
df.quantile([.1, .25, .5, .75], axis = 0)

        A    B    C    D
0.10  1.4  2.4  2.0  3.4
0.25  2.0  3.0  2.0  4.0
0.50  3.0  3.0  3.0  6.0
0.75  4.0  4.0  4.0  7.0

## pd.DataFrame.sum()

In [178]:
idx = pd.MultiIndex.from_arrays([
    ['warm', 'warm', 'cold', 'cold'],
    ['dog', 'falcon', 'fish', 'spider']],
    names = ['blooded', 'animal']
)

s = pd.Series([4, 2, 0, 8], name = 'legs', index = idx)

s

blooded  animal
warm     dog       4
         falcon    2
cold     fish      0
         spider    8
Name: legs, dtype: int64

In [179]:
s.sum()

14

In [180]:
s.sum(level = 'blooded')

blooded
warm    6
cold    8
Name: legs, dtype: int64

In [181]:
s.sum(level = 0)

blooded
warm    6
cold    8
Name: legs, dtype: int64

In [182]:
pd.Series([]).sum()   # min_count = 0 is the default

0.0

In [183]:
pd.Series([]).sum(min_count = 1)

nan

In [184]:
pd.Series([np.nan]).sum()

0.0

In [185]:
pd.Series([np.nan]).sum(min_count = 1)

nan

In [186]:
df = pd.read_csv("https://cdncontribute.geeksforgeeks.org/wp-content/uploads/nba.csv")
                 
df

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
5,Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,NaN,12000000.0
6,Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0
7,Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0
8,Terry Rozier,Boston Celtics,12.0,PG,22.0,6-2,190.0,Louisville,1824360.0
9,Marcus Smart,Boston Celtics,36.0,PG,22.0,6-4,220.0,Oklahoma State,3431040.0
10,Jared Sullinger,Boston Celtics,7.0,C,24.0,6-9,260.0,Ohio State,2569260.0
11,Isaiah Thomas,Boston Celtics,4.0,PG,27.0,5-9,185.0,Washington,6912869.0
12,Evan Turner,Boston Celtics,11.0,SG,27.0,6-7,220.0,Ohio State,3425510.0
13,James Young,Boston Celtics,13.0,SG,20.0,6-6,215.0,Kentucky,1749840.0
14,Tyler Zeller,Boston Celtics,44.0,C,26.0,7-0,253.0,North Carolina,2616975.0
15,Bojan Bogdanovic,Brooklyn Nets,44.0,SG,27.0,6-8,216.0,NaN,3425510.0
16,Markel Brown,Brooklyn Nets,22.0,SG,24.0,6-3,190.0,Oklahoma State,845059.0
17,Wayne Ellington,Brooklyn Nets,21.0,SG,28.0,6-4,200.0,North Carolina,1500000.0
18,Rondae Hollis-Jefferson,Brooklyn Nets,24.0,SG,21.0,6-7,220.0,Arizona,1335480.0
19,Jarrett Jack,Brooklyn Nets,2.0,PG,32.0,6-3,200.0,Georgia Tech,6300000.0
20,Sergey Karasev,Brooklyn Nets,10.0,SG,22.0,6-7,208.0,NaN,1599840.0
21,Sean Kilpatrick,Brooklyn Nets,6.0,SG,26.0,6-4,219.0,Cincinnati,134215.0
22,Shane Larkin,Brooklyn Nets,0.0,PG,23.0,5-11,175.0,Miami (FL),1500000.0
23,Brook Lopez,Brooklyn Nets,11.0,C,28.0,7-0,275.0,Stanford,19689000.0
24,Chris McCullough,Brooklyn Nets,1.0,PF,21.0,6-11,200.0,Syracuse,1140240.0
25,Willie Reed,Brooklyn Nets,33.0,PF,26.0,6-10,220.0,Saint Louis,947276.0
26,Thomas Robinson,Brooklyn Nets,41.0,PF,25.0,6-10,237.0,Kansas,981348.0
27,Henry Sims,Brooklyn Nets,14.0,C,26.0,6-10,248.0,Georgetown,947276.0
28,Donald Sloan,Brooklyn Nets,15.0,PG,28.0,6-3,205.0,Texas A&M,947276.0
29,Thaddeus Young,Brooklyn Nets,30.0,PF,27.0,6-8,221.0,Georgia Tech,11235955.0
...,...,...,...,...,...,...,...,...,...
428,Al-Farouq Aminu,Portland Trail Blazers,8.0,SF,25.0,6-9,215.0,Wake Forest,8042895.0
429,Pat Connaughton,Portland Trail Blazers,5.0,SG,23.0,6-5,206.0,Notre Dame,625093.0
430,Allen Crabbe,Portland Trail Blazers,23.0,SG,24.0,6-6,210.0,California,947276.0
431,Ed Davis,Portland Trail Blazers,17.0,C,27.0,6-10,240.0,North Carolina,6980802.0
432,Maurice Harkless,Portland Trail Blazers,4.0,SF,23.0,6-9,215.0,St. John's,2894059.0
433,Gerald Henderson,Portland Trail Blazers,9.0,SG,28.0,6-5,215.0,Duke,6000000.0
434,Chris Kaman,Portland Trail Blazers,35.0,C,34.0,7-0,265.0,Central Michigan,5016000.0
435,Meyers Leonard,Portland Trail Blazers,11.0,PF,24.0,7-1,245.0,Illinois,3075880.0
436,Damian Lillard,Portland Trail Blazers,0.0,PG,25.0,6-3,195.0,Weber State,4236287.0
437,C.J. McCollum,Portland Trail Blazers,3.0,SG,24.0,6-4,200.0,Lehigh,2525160.0
438,Luis Montero,Portland Trail Blazers,44.0,SG,23.0,6-7,185.0,Westchester CC,525093.0
439,Mason Plumlee,Portland Trail Blazers,24.0,C,26.0,6-11,235.0,Duke,1415520.0
440,Brian Roberts,Portland Trail Blazers,2.0,PG,30.0,6-1,173.0,Dayton,2854940.0
441,Noah Vonleh,Portland Trail Blazers,21.0,PF,20.0,6-9,240.0,Indiana,2637720.0
442,Trevor Booker,Utah Jazz,33.0,PF,28.0,6-8,228.0,Clemson,4775000.0
443,Trey Burke,Utah Jazz,3.0,PG,23.0,6-1,191.0,Michigan,2658240.0
444,Alec Burks,Utah Jazz,10.0,SG,24.0,6-6,214.0,Colorado,9463484.0
445,Dante Exum,Utah Jazz,11.0,PG,20.0,6-6,190.0,NaN,3777720.0
446,Derrick Favors,Utah Jazz,15.0,PF,24.0,6-10,265.0,Georgia Tech,12000000.0
447,Rudy Gobert,Utah Jazz,27.0,C,23.0,7-1,245.0,NaN,1175880.0
448,Gordon Hayward,Utah Jazz,20.0,SF,26.0,6-8,226.0,Butler,15409570.0
449,Rodney Hood,Utah Jazz,5.0,SG,23.0,6-8,206.0,Duke,1348440.0
450,Joe Ingles,Utah Jazz,2.0,SF,28.0,6-8,226.0,NaN,2050000.0
451,Chris Johnson,Utah Jazz,23.0,SF,26.0,6-6,206.0,Dayton,981348.0
452,Trey Lyles,Utah Jazz,41.0,PF,20.0,6-10,234.0,Kentucky,2239800.0
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [187]:
df.sum(axis = 0, skipna = True)

Number    8.079000e+03
Age       1.231100e+04
Weight    1.012360e+05
Salary    2.159837e+09
dtype: float64

In [188]:
df.sum(axis = 1, skipna = True)

0       7730542.0
1       6796476.0
2           262.0
3       1148875.0
4       5000268.0
5      12000359.0
6       1171271.0
7       2165464.0
8       1824584.0
9       3431318.0
10      2569551.0
11      6913085.0
12      3425768.0
13      1750088.0
14      2617298.0
15      3425797.0
16       845295.0
17      1500249.0
18      1335745.0
19      6300234.0
20      1600080.0
21       134466.0
22      1500198.0
23     19689314.0
24      1140462.0
25       947555.0
26       981651.0
27       947564.0
28       947524.0
29     11236233.0
          ...
428     8043143.0
429      625327.0
430      947533.0
431     6981086.0
432     2894301.0
433     6000252.0
434     5016334.0
435     3076160.0
436     4236507.0
437     2525387.0
438      525345.0
439     1415805.0
440     2855145.0
441     2638001.0
442     4775289.0
443     2658457.0
444     9463732.0
445     3777941.0
446    12000304.0
447     1176175.0
448    15409842.0
449     1348674.0
450     2050256.0
451      981603.0
452     2240095.0
453     2433570.0
454      900228.0
455     2900303.0
456      947557.0
457           0.0
Length: 458, dtype: float64

## pd.DataFrame.mean()

In [189]:
df = pd.DataFrame({"A": [12, 4, 5, 44, 1],
                   "B": [5, 2, 54, 3, 2],
                   "C": [20, 16, 7, 3, 8],
                   "D": [14, 3, 17, 2, 6]})

df

    A   B   C   D
0  12   5  20  14
1   4   2  16   3
2   5  54   7  17
3  44   3   3   2
4   1   2   8   6

In [190]:
df.mean(axis = 0)

A    13.2
B    13.2
C    10.8
D     8.4
dtype: float64

In [191]:
df = pd.DataFrame({"A": [12, 4, 5, None, 1],
                   "B": [7, 2, 54, 3, None],
                   "C": [20, 16, 11, 3, 8],
                   "D": [14, 3, None, 2, 6]})

df

      A     B   C     D
0  12.0   7.0  20  14.0
1   4.0   2.0  16   3.0
2   5.0  54.0  11   NaN
3   NaN   3.0   3   2.0
4   1.0   NaN   8   6.0

In [192]:
df.mean(axis = 1, skipna = True)

0    13.250000
1     6.250000
2    23.333333
3     2.666667
4     5.000000
dtype: float64

## pd.DataFrame.median()

In [193]:
df = pd.DataFrame({"A": [12, 4, 5, 44, 1],
                   "B": [5, 2, 54, 3, 2],
                   "C": [20, 16, 7, 3, 8],
                   "D": [14, 3, 17, 2, 6]})

df

    A   B   C   D
0  12   5  20  14
1   4   2  16   3
2   5  54   7  17
3  44   3   3   2
4   1   2   8   6

In [194]:
df.median(axis = 0)

A    5.0
B    3.0
C    8.0
D    6.0
dtype: float64

In [195]:
df = pd.DataFrame({"A": [12, 4, 5, None, 1],
                   "B": [7, 2, 54, 3, None],
                   "C": [20, 16, 11, 3, 8],
                   "D": [14, 3, None, 2, 6]})

df

      A     B   C     D
0  12.0   7.0  20  14.0
1   4.0   2.0  16   3.0
2   5.0  54.0  11   NaN
3   NaN   3.0   3   2.0
4   1.0   NaN   8   6.0

In [196]:
df.median(axis = 1, skipna = True)

0    13.0
1     3.5
2    11.0
3     3.0
4     6.0
dtype: float64

## pd.DataFrame.mad()

In [197]:
df = pd.DataFrame({"A": [12, 4, 5, 44, 1],
                   "B": [5, 2, 54, 3, 2],
                   "C": [20, 16, 7, 3, 8],
                   "D": [14, 3, 17, 2, 6]})

df

    A   B   C   D
0  12   5  20  14
1   4   2  16   3
2   5  54   7  17
3  44   3   3   2
4   1   2   8   6

In [198]:
df.mad(axis = 0)

A    12.32
B    16.32
C     5.76
D     5.68
dtype: float64

In [199]:
df = pd.DataFrame({"A": [12, 4, 5, None, 1],
                   "B": [7, 2, 54, 3, None],
                   "C": [20, 16, 11, 3, 8],
                   "D": [14, 3, None, 2, 6]})

df

      A     B   C     D
0  12.0   7.0  20  14.0
1   4.0   2.0  16   3.0
2   5.0  54.0  11   NaN
3   NaN   3.0   3   2.0
4   1.0   NaN   8   6.0

In [200]:
df.mad(axis = 1, skipna = True)

0     3.750000
1     4.875000
2    20.444444
3     0.444444
4     2.666667
dtype: float64

## pd.DataFrame.prod()

In [201]:
pd.Series([]).prod()

1.0

In [202]:
pd.Series([]).prod(min_count = 1)

nan

In [203]:
pd.Series([np.nan]).prod()

1.0

In [204]:
pd.Series([np.nan]).prod(min_count = 1)

nan

In [205]:
df = pd.DataFrame({"A": [1, 5, 3, 4, 2],
                   "B": [3, 2, 4, 3, 4],
                   "C": [2, 2, 7, 3, 4],
                   "D": [4, 3, 6, 12, 7]})

df

   A  B  C   D
0  1  3  2   4
1  5  2  2   3
2  3  4  7   6
3  4  3  3  12
4  2  4  4   7

In [206]:
df.prod(axis = 1)

0     24
1     60
2    504
3    432
4    224
dtype: int64

In [207]:
df = pd.DataFrame({"A": [1, 5, 3, 4 ,2],
                   "B": [3, None, 4, 3, 4],
                   "C": [2, 2, 7, None, 4],
                   "D": [None, 3, 6, 12, 7]})

df

   A    B    C     D
0  1  3.0  2.0   NaN
1  5  NaN  2.0   3.0
2  3  4.0  7.0   6.0
3  4  3.0  NaN  12.0
4  2  4.0  4.0   7.0

In [208]:
df.prod(axis = 1, skipna = True)

0      6.0
1     30.0
2    504.0
3    144.0
4    224.0
dtype: float64

## pd.DataFrame.var()

In [209]:
## See pd.Series.var()

sr = pd.Series([19.5, 16.8, 22.78, 20.124, 18.1002])

sr

0    19.5000
1    16.8000
2    22.7800
3    20.1240
4    18.1002
dtype: float64

In [210]:
sr.var()

5.097387128

In [211]:
sr = pd.Series([100, 214, 325, 88, None, 325, None, 68])

sr

0    100.0
1    214.0
2    325.0
3     88.0
4      NaN
5    325.0
6      NaN
7     68.0
dtype: float64

In [212]:
sr.var(skipna = True)

14069.466666666669

## pd.DataFrame.std()

In [213]:
df = pd.read_csv("https://cdncontribute.geeksforgeeks.org/wp-content/uploads/nba.csv")

df

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
5,Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,NaN,12000000.0
6,Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0
7,Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0
8,Terry Rozier,Boston Celtics,12.0,PG,22.0,6-2,190.0,Louisville,1824360.0
9,Marcus Smart,Boston Celtics,36.0,PG,22.0,6-4,220.0,Oklahoma State,3431040.0
10,Jared Sullinger,Boston Celtics,7.0,C,24.0,6-9,260.0,Ohio State,2569260.0
11,Isaiah Thomas,Boston Celtics,4.0,PG,27.0,5-9,185.0,Washington,6912869.0
12,Evan Turner,Boston Celtics,11.0,SG,27.0,6-7,220.0,Ohio State,3425510.0
13,James Young,Boston Celtics,13.0,SG,20.0,6-6,215.0,Kentucky,1749840.0
14,Tyler Zeller,Boston Celtics,44.0,C,26.0,7-0,253.0,North Carolina,2616975.0
15,Bojan Bogdanovic,Brooklyn Nets,44.0,SG,27.0,6-8,216.0,NaN,3425510.0
16,Markel Brown,Brooklyn Nets,22.0,SG,24.0,6-3,190.0,Oklahoma State,845059.0
17,Wayne Ellington,Brooklyn Nets,21.0,SG,28.0,6-4,200.0,North Carolina,1500000.0
18,Rondae Hollis-Jefferson,Brooklyn Nets,24.0,SG,21.0,6-7,220.0,Arizona,1335480.0
19,Jarrett Jack,Brooklyn Nets,2.0,PG,32.0,6-3,200.0,Georgia Tech,6300000.0
20,Sergey Karasev,Brooklyn Nets,10.0,SG,22.0,6-7,208.0,NaN,1599840.0
21,Sean Kilpatrick,Brooklyn Nets,6.0,SG,26.0,6-4,219.0,Cincinnati,134215.0
22,Shane Larkin,Brooklyn Nets,0.0,PG,23.0,5-11,175.0,Miami (FL),1500000.0
23,Brook Lopez,Brooklyn Nets,11.0,C,28.0,7-0,275.0,Stanford,19689000.0
24,Chris McCullough,Brooklyn Nets,1.0,PF,21.0,6-11,200.0,Syracuse,1140240.0
25,Willie Reed,Brooklyn Nets,33.0,PF,26.0,6-10,220.0,Saint Louis,947276.0
26,Thomas Robinson,Brooklyn Nets,41.0,PF,25.0,6-10,237.0,Kansas,981348.0
27,Henry Sims,Brooklyn Nets,14.0,C,26.0,6-10,248.0,Georgetown,947276.0
28,Donald Sloan,Brooklyn Nets,15.0,PG,28.0,6-3,205.0,Texas A&M,947276.0
29,Thaddeus Young,Brooklyn Nets,30.0,PF,27.0,6-8,221.0,Georgia Tech,11235955.0
...,...,...,...,...,...,...,...,...,...
428,Al-Farouq Aminu,Portland Trail Blazers,8.0,SF,25.0,6-9,215.0,Wake Forest,8042895.0
429,Pat Connaughton,Portland Trail Blazers,5.0,SG,23.0,6-5,206.0,Notre Dame,625093.0
430,Allen Crabbe,Portland Trail Blazers,23.0,SG,24.0,6-6,210.0,California,947276.0
431,Ed Davis,Portland Trail Blazers,17.0,C,27.0,6-10,240.0,North Carolina,6980802.0
432,Maurice Harkless,Portland Trail Blazers,4.0,SF,23.0,6-9,215.0,St. John's,2894059.0
433,Gerald Henderson,Portland Trail Blazers,9.0,SG,28.0,6-5,215.0,Duke,6000000.0
434,Chris Kaman,Portland Trail Blazers,35.0,C,34.0,7-0,265.0,Central Michigan,5016000.0
435,Meyers Leonard,Portland Trail Blazers,11.0,PF,24.0,7-1,245.0,Illinois,3075880.0
436,Damian Lillard,Portland Trail Blazers,0.0,PG,25.0,6-3,195.0,Weber State,4236287.0
437,C.J. McCollum,Portland Trail Blazers,3.0,SG,24.0,6-4,200.0,Lehigh,2525160.0
438,Luis Montero,Portland Trail Blazers,44.0,SG,23.0,6-7,185.0,Westchester CC,525093.0
439,Mason Plumlee,Portland Trail Blazers,24.0,C,26.0,6-11,235.0,Duke,1415520.0
440,Brian Roberts,Portland Trail Blazers,2.0,PG,30.0,6-1,173.0,Dayton,2854940.0
441,Noah Vonleh,Portland Trail Blazers,21.0,PF,20.0,6-9,240.0,Indiana,2637720.0
442,Trevor Booker,Utah Jazz,33.0,PF,28.0,6-8,228.0,Clemson,4775000.0
443,Trey Burke,Utah Jazz,3.0,PG,23.0,6-1,191.0,Michigan,2658240.0
444,Alec Burks,Utah Jazz,10.0,SG,24.0,6-6,214.0,Colorado,9463484.0
445,Dante Exum,Utah Jazz,11.0,PG,20.0,6-6,190.0,NaN,3777720.0
446,Derrick Favors,Utah Jazz,15.0,PF,24.0,6-10,265.0,Georgia Tech,12000000.0
447,Rudy Gobert,Utah Jazz,27.0,C,23.0,7-1,245.0,NaN,1175880.0
448,Gordon Hayward,Utah Jazz,20.0,SF,26.0,6-8,226.0,Butler,15409570.0
449,Rodney Hood,Utah Jazz,5.0,SG,23.0,6-8,206.0,Duke,1348440.0
450,Joe Ingles,Utah Jazz,2.0,SF,28.0,6-8,226.0,NaN,2050000.0
451,Chris Johnson,Utah Jazz,23.0,SF,26.0,6-6,206.0,Dayton,981348.0
452,Trey Lyles,Utah Jazz,41.0,PF,20.0,6-10,234.0,Kentucky,2239800.0
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [214]:
df.std(axis = 0, skipna = True)

Number    1.596609e+01
Age       4.404016e+00
Weight    2.636834e+01
Salary    5.229238e+06
dtype: float64

In [215]:
df.std(axis = 1, skipna = True)

0      3.865134e+06
1      3.397999e+06
2      1.019134e+02
3      5.742808e+05
4      2.499955e+06
5      5.999940e+06
6      5.854282e+05
7      1.082529e+06
8      9.121427e+05
9      1.715474e+06
10     1.284582e+06
11     3.456399e+06
12     1.712712e+06
13     8.748787e+05
14     1.308434e+06
15     1.712707e+06
16     4.224902e+05
17     7.499585e+05
18     6.676958e+05
19     3.149961e+06
20     7.998800e+05
21     6.706574e+04
22     7.499670e+05
23     9.844448e+06
24     5.700830e+05
25     4.735915e+05
26     4.906235e+05
27     4.735900e+05
28     4.735967e+05
29     5.617931e+06
           ...
428    4.021406e+06
429    3.125075e+05
430    4.735952e+05
431    3.490354e+06
432    1.446989e+06
433    2.999958e+06
434    2.507944e+06
435    1.537893e+06
436    2.118107e+06
437    1.262542e+06
438    2.625045e+05
439    7.077125e+05
440    1.427436e+06
441    1.318813e+06
442    2.387452e+06
443    1.329084e+06
444    4.731701e+06
445    1.888823e+06
446    5.999949e+06
447    5.878908e+05
448    7.704740e+06
449    6.741810e+05
450    1.024957e+06
451    4.906315e+05
452    1.119851e+06
453    1.216627e+06
454    4.499620e+05
455    1.449950e+06
456    4.735912e+05
457             NaN
Length: 458, dtype: float64

## pd.DataFrame.skew()

In [216]:
df = pd.read_csv("https://cdncontribute.geeksforgeeks.org/wp-content/uploads/nba.csv")

df

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
5,Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,NaN,12000000.0
6,Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0
7,Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0
8,Terry Rozier,Boston Celtics,12.0,PG,22.0,6-2,190.0,Louisville,1824360.0
9,Marcus Smart,Boston Celtics,36.0,PG,22.0,6-4,220.0,Oklahoma State,3431040.0
10,Jared Sullinger,Boston Celtics,7.0,C,24.0,6-9,260.0,Ohio State,2569260.0
11,Isaiah Thomas,Boston Celtics,4.0,PG,27.0,5-9,185.0,Washington,6912869.0
12,Evan Turner,Boston Celtics,11.0,SG,27.0,6-7,220.0,Ohio State,3425510.0
13,James Young,Boston Celtics,13.0,SG,20.0,6-6,215.0,Kentucky,1749840.0
14,Tyler Zeller,Boston Celtics,44.0,C,26.0,7-0,253.0,North Carolina,2616975.0
15,Bojan Bogdanovic,Brooklyn Nets,44.0,SG,27.0,6-8,216.0,NaN,3425510.0
16,Markel Brown,Brooklyn Nets,22.0,SG,24.0,6-3,190.0,Oklahoma State,845059.0
17,Wayne Ellington,Brooklyn Nets,21.0,SG,28.0,6-4,200.0,North Carolina,1500000.0
18,Rondae Hollis-Jefferson,Brooklyn Nets,24.0,SG,21.0,6-7,220.0,Arizona,1335480.0
19,Jarrett Jack,Brooklyn Nets,2.0,PG,32.0,6-3,200.0,Georgia Tech,6300000.0
20,Sergey Karasev,Brooklyn Nets,10.0,SG,22.0,6-7,208.0,NaN,1599840.0
21,Sean Kilpatrick,Brooklyn Nets,6.0,SG,26.0,6-4,219.0,Cincinnati,134215.0
22,Shane Larkin,Brooklyn Nets,0.0,PG,23.0,5-11,175.0,Miami (FL),1500000.0
23,Brook Lopez,Brooklyn Nets,11.0,C,28.0,7-0,275.0,Stanford,19689000.0
24,Chris McCullough,Brooklyn Nets,1.0,PF,21.0,6-11,200.0,Syracuse,1140240.0
25,Willie Reed,Brooklyn Nets,33.0,PF,26.0,6-10,220.0,Saint Louis,947276.0
26,Thomas Robinson,Brooklyn Nets,41.0,PF,25.0,6-10,237.0,Kansas,981348.0
27,Henry Sims,Brooklyn Nets,14.0,C,26.0,6-10,248.0,Georgetown,947276.0
28,Donald Sloan,Brooklyn Nets,15.0,PG,28.0,6-3,205.0,Texas A&M,947276.0
29,Thaddeus Young,Brooklyn Nets,30.0,PF,27.0,6-8,221.0,Georgia Tech,11235955.0
...,...,...,...,...,...,...,...,...,...
428,Al-Farouq Aminu,Portland Trail Blazers,8.0,SF,25.0,6-9,215.0,Wake Forest,8042895.0
429,Pat Connaughton,Portland Trail Blazers,5.0,SG,23.0,6-5,206.0,Notre Dame,625093.0
430,Allen Crabbe,Portland Trail Blazers,23.0,SG,24.0,6-6,210.0,California,947276.0
431,Ed Davis,Portland Trail Blazers,17.0,C,27.0,6-10,240.0,North Carolina,6980802.0
432,Maurice Harkless,Portland Trail Blazers,4.0,SF,23.0,6-9,215.0,St. John's,2894059.0
433,Gerald Henderson,Portland Trail Blazers,9.0,SG,28.0,6-5,215.0,Duke,6000000.0
434,Chris Kaman,Portland Trail Blazers,35.0,C,34.0,7-0,265.0,Central Michigan,5016000.0
435,Meyers Leonard,Portland Trail Blazers,11.0,PF,24.0,7-1,245.0,Illinois,3075880.0
436,Damian Lillard,Portland Trail Blazers,0.0,PG,25.0,6-3,195.0,Weber State,4236287.0
437,C.J. McCollum,Portland Trail Blazers,3.0,SG,24.0,6-4,200.0,Lehigh,2525160.0
438,Luis Montero,Portland Trail Blazers,44.0,SG,23.0,6-7,185.0,Westchester CC,525093.0
439,Mason Plumlee,Portland Trail Blazers,24.0,C,26.0,6-11,235.0,Duke,1415520.0
440,Brian Roberts,Portland Trail Blazers,2.0,PG,30.0,6-1,173.0,Dayton,2854940.0
441,Noah Vonleh,Portland Trail Blazers,21.0,PF,20.0,6-9,240.0,Indiana,2637720.0
442,Trevor Booker,Utah Jazz,33.0,PF,28.0,6-8,228.0,Clemson,4775000.0
443,Trey Burke,Utah Jazz,3.0,PG,23.0,6-1,191.0,Michigan,2658240.0
444,Alec Burks,Utah Jazz,10.0,SG,24.0,6-6,214.0,Colorado,9463484.0
445,Dante Exum,Utah Jazz,11.0,PG,20.0,6-6,190.0,NaN,3777720.0
446,Derrick Favors,Utah Jazz,15.0,PF,24.0,6-10,265.0,Georgia Tech,12000000.0
447,Rudy Gobert,Utah Jazz,27.0,C,23.0,7-1,245.0,NaN,1175880.0
448,Gordon Hayward,Utah Jazz,20.0,SF,26.0,6-8,226.0,Butler,15409570.0
449,Rodney Hood,Utah Jazz,5.0,SG,23.0,6-8,206.0,Duke,1348440.0
450,Joe Ingles,Utah Jazz,2.0,SF,28.0,6-8,226.0,NaN,2050000.0
451,Chris Johnson,Utah Jazz,23.0,SF,26.0,6-6,206.0,Dayton,981348.0
452,Trey Lyles,Utah Jazz,41.0,PF,20.0,6-10,234.0,Kentucky,2239800.0
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [217]:
df.skew(axis = 0, skipna = True)

Number    1.668386
Age       0.626349
Weight    0.113788
Salary    1.576321
dtype: float64

In [218]:
df.skew(axis = 1, skipna = True)

0      2.000000
1      2.000000
2      1.730362
3      2.000000
4      2.000000
5      2.000000
6      2.000000
7      2.000000
8      2.000000
9      2.000000
10     2.000000
11     2.000000
12     2.000000
13     2.000000
14     2.000000
15     2.000000
16     2.000000
17     2.000000
18     2.000000
19     2.000000
20     2.000000
21     1.999988
22     2.000000
23     2.000000
24     2.000000
25     2.000000
26     2.000000
27     2.000000
28     2.000000
29     2.000000
         ...
428    2.000000
429    1.999999
430    2.000000
431    2.000000
432    2.000000
433    2.000000
434    2.000000
435    2.000000
436    2.000000
437    2.000000
438    2.000000
439    2.000000
440    2.000000
441    2.000000
442    2.000000
443    2.000000
444    2.000000
445    2.000000
446    2.000000
447    2.000000
448    2.000000
449    2.000000
450    2.000000
451    2.000000
452    2.000000
453    2.000000
454    2.000000
455    2.000000
456    2.000000
457         NaN
Length: 458, dtype: float64

## pd.DataFrame.kurt()

In [219]:
df = pd.DataFrame({"A": [12, 4, 5, 44, 1],
                   "B": [5, 2, 54, 3, 2],
                   "C": [20, 16, 7, 3, 8],
                   "D": [14, 3, 17, 2, 6]})

df

    A   B   C   D
0  12   5  20  14
1   4   2  16   3
2   5  54   7  17
3  44   3   3   2
4   1   2   8   6

In [220]:
df.kurt(axis = 0)

A    3.936824
B    4.941512
C   -1.745717
D   -2.508808
dtype: float64

In [221]:
df = pd.DataFrame({"A": [12, 4, 5, None, 1],
                   "B": [7, 2, 54, 3, None],
                   "C": [20, 16, 11, 3, 8],
                   "D": [14, 3, None, 2, 6]})

df

      A     B   C     D
0  12.0   7.0  20  14.0
1   4.0   2.0  16   3.0
2   5.0  54.0  11   NaN
3   NaN   3.0   3   2.0
4   1.0   NaN   8   6.0

In [222]:
df.kurt(axis = 0, skipna = True)

A    2.123077
B    3.845168
C   -0.998884
D    1.907717
dtype: float64

## pd.DataFrame.cumsum()

In [223]:
s = pd.Series([2, np.nan, 5, -1, 0])

s

0    2.0
1    NaN
2    5.0
3   -1.0
4    0.0
dtype: float64

In [224]:
s.cumsum()

0    2.0
1    NaN
2    7.0
3    6.0
4    6.0
dtype: float64

In [225]:
s.cumsum(skipna = False)

0    2.0
1    NaN
2    NaN
3    NaN
4    NaN
dtype: float64

In [226]:
df = pd.DataFrame([[2.0, 1.0],
                   [3.0, np.nan],
                   [1.0, 0.0]],
                  columns = list('AB'))

df

     A    B
0  2.0  1.0
1  3.0  NaN
2  1.0  0.0

In [227]:
df.cumsum()

     A    B
0  2.0  1.0
1  5.0  NaN
2  6.0  1.0

In [228]:
df.cumsum(axis = 1)

     A    B
0  2.0  3.0
1  3.0  NaN
2  1.0  1.0

In [229]:
df = pd.DataFrame({"A": [5, 3, 6, 4],
                   "B": [11, 2, 4, 3],
                   "C": [4, 3, 8, 5],
                   "D": [5, 4, 2, 8]})

df

   A   B  C  D
0  5  11  4  5
1  3   2  3  4
2  6   4  8  2
3  4   3  5  8

In [230]:
df.cumsum(axis = 0)

    A   B   C   D
0   5  11   4   5
1   8  13   7   9
2  14  17  15  11
3  18  20  20  19

In [231]:
df.cumsum(axis = 1)

   A   B   C   D
0  5  16  20  25
1  3   5   8  12
2  6  10  18  20
3  4   7  12  20

In [232]:
df = pd.DataFrame({"A": [5, 3, None, 4],
                   "B": [None, 2, 4, 3],
                   "C": [4, 3, 8, 5],
                   "D": [5, 4, 2, None]})

df

     A    B  C    D
0  5.0  NaN  4  5.0
1  3.0  2.0  3  4.0
2  NaN  4.0  8  2.0
3  4.0  3.0  5  NaN

In [233]:
df.cumsum(axis = 0, skipna = True)

      A    B     C     D
0   5.0  NaN   4.0   5.0
1   8.0  2.0   7.0   9.0
2   NaN  6.0  15.0  11.0
3  12.0  9.0  20.0   NaN

## pd.DataFrame.cummin()

In [234]:
s = pd.Series([2, np.nan, 5, -1, 0])

s

0    2.0
1    NaN
2    5.0
3   -1.0
4    0.0
dtype: float64

In [235]:
s.cummin()

0    2.0
1    NaN
2    2.0
3   -1.0
4   -1.0
dtype: float64

In [236]:
s.cummin(skipna = False)

0    2.0
1    NaN
2    NaN
3    NaN
4    NaN
dtype: float64

In [237]:
df = pd.DataFrame([[2.0, 1.0],
                   [3.0, np.nan],
                   [1.0, 0.0]],
                  columns = list('AB'))

df

     A    B
0  2.0  1.0
1  3.0  NaN
2  1.0  0.0

In [238]:
df.cummin()

     A    B
0  2.0  1.0
1  2.0  NaN
2  1.0  0.0

In [239]:
df.cummin(axis = 1)

     A    B
0  2.0  1.0
1  3.0  NaN
2  1.0  0.0

In [240]:
df = pd.DataFrame({"A": [5, 3, 6, 4],
                   "B": [11, 2, 4, 3],
                   "C": [4, 3, 8, 5],
                   "D": [5, 4, 2, 8]})

df

   A   B  C  D
0  5  11  4  5
1  3   2  3  4
2  6   4  8  2
3  4   3  5  8

In [241]:
df.cummin(axis = 0)

   A   B  C  D
0  5  11  4  5
1  3   2  3  4
2  3   2  3  2
3  3   2  3  2

In [242]:
df.cummin(axis = 1)

   A  B  C  D
0  5  5  4  4
1  3  2  2  2
2  6  4  4  2
3  4  3  3  3

In [243]:
df = pd.DataFrame({"A": [5, 3, None, 4],
                   "B": [None, 2, 4, 3],
                   "C": [4, 3, 8, 5],
                   "D": [5, 4, 2, None]})

df

     A    B  C    D
0  5.0  NaN  4  5.0
1  3.0  2.0  3  4.0
2  NaN  4.0  8  2.0
3  4.0  3.0  5  NaN

In [244]:
df.cummin(axis = 0, skipna = True)

     A    B    C    D
0  5.0  NaN  4.0  5.0
1  3.0  2.0  3.0  4.0
2  NaN  2.0  3.0  2.0
3  3.0  2.0  3.0  NaN

In [245]:
df.cummin(axis = 0, skipna = False)

     A   B    C    D
0  5.0 NaN  4.0  5.0
1  3.0 NaN  3.0  4.0
2  NaN NaN  3.0  2.0
3  NaN NaN  3.0  NaN

## pd.DataFrame.cummax()

In [246]:
s = pd.Series([2, np.nan, 5, -1, 0])

s

0    2.0
1    NaN
2    5.0
3   -1.0
4    0.0
dtype: float64

In [247]:
s.cummax()

0    2.0
1    NaN
2    5.0
3    5.0
4    5.0
dtype: float64

In [248]:
s.cummax(skipna = False)

0    2.0
1    NaN
2    NaN
3    NaN
4    NaN
dtype: float64

In [249]:
df = pd.DataFrame([[2.0, 1.0],
                   [3.0, np.nan],
                   [1.0, 0.0]],
                  columns = list('AB'))

df

     A    B
0  2.0  1.0
1  3.0  NaN
2  1.0  0.0

In [250]:
df.cummax()

     A    B
0  2.0  1.0
1  3.0  NaN
2  3.0  1.0

In [251]:
df.cummax(axis = 1)

     A    B
0  2.0  2.0
1  3.0  NaN
2  1.0  1.0

In [252]:
df = pd.DataFrame({"A": [5, 3, 6, 4],
                   "B": [11, 2, 4, 3],
                   "C": [4, 3, 8, 5],
                   "D": [5, 4, 2, 8]})

df

   A   B  C  D
0  5  11  4  5
1  3   2  3  4
2  6   4  8  2
3  4   3  5  8

In [253]:
df.cummax(axis = 0)

   A   B  C  D
0  5  11  4  5
1  5  11  4  5
2  6  11  8  5
3  6  11  8  8

In [254]:
df.cummax(axis = 1)

   A   B   C   D
0  5  11  11  11
1  3   3   3   4
2  6   6   8   8
3  4   4   5   8

In [255]:
df = pd.DataFrame({"A": [5, 3, None, 4],
                   "B": [None, 2, 4, 3],
                   "C": [4, 3, 8, 5],
                   "D": [5, 4, 2, None]})

df

     A    B  C    D
0  5.0  NaN  4  5.0
1  3.0  2.0  3  4.0
2  NaN  4.0  8  2.0
3  4.0  3.0  5  NaN

In [256]:
df.cummax(axis = 0, skipna = True)

     A    B    C    D
0  5.0  NaN  4.0  5.0
1  5.0  2.0  4.0  5.0
2  NaN  4.0  8.0  5.0
3  5.0  4.0  8.0  NaN

## pd.DataFrame.cumprod()

In [257]:
s = pd.Series([2, np.nan, 5, -1, 0])

s

0    2.0
1    NaN
2    5.0
3   -1.0
4    0.0
dtype: float64

In [258]:
s.cumprod()

0     2.0
1     NaN
2    10.0
3   -10.0
4    -0.0
dtype: float64

In [259]:
s.cumprod(skipna = False)

0    2.0
1    NaN
2    NaN
3    NaN
4    NaN
dtype: float64

In [260]:
df = pd.DataFrame([[2.0, 1.0],
                   [3.0, np.nan],
                   [1.0, 0.0]],
                  columns = list('AB'))

df

     A    B
0  2.0  1.0
1  3.0  NaN
2  1.0  0.0

In [261]:
df.cumprod()

     A    B
0  2.0  1.0
1  6.0  NaN
2  6.0  0.0

In [262]:
df.cumprod(axis = 1)

     A    B
0  2.0  2.0
1  3.0  NaN
2  1.0  0.0

In [263]:
df = pd.DataFrame({"A": [5, 3, 6, 4],
                   "B": [11, 2, 4, 3],
                   "C": [4, 3, 8, 5],
                   "D": [5, 4, 2, 8]})

df

   A   B  C  D
0  5  11  4  5
1  3   2  3  4
2  6   4  8  2
3  4   3  5  8

In [264]:
df.cumprod(axis = 0)

     A    B    C    D
0    5   11    4    5
1   15   22   12   20
2   90   88   96   40
3  360  264  480  320

In [265]:
df.cumprod(axis = 1)

   A   B    C     D
0  5  55  220  1100
1  3   6   18    72
2  6  24  192   384
3  4  12   60   480

In [266]:
df = pd.DataFrame({"A": [5, 3, None, 4],
                   "B": [None, 2, 4, 3],
                   "C": [4, 3, 8, 5],
                   "D": [5, 4, 2, None]})

df

     A    B  C    D
0  5.0  NaN  4  5.0
1  3.0  2.0  3  4.0
2  NaN  4.0  8  2.0
3  4.0  3.0  5  NaN

In [267]:
df.cumprod(axis = 0, skipna = True)

      A     B      C     D
0   5.0   NaN    4.0   5.0
1  15.0   2.0   12.0  20.0
2   NaN   8.0   96.0  40.0
3  60.0  24.0  480.0   NaN

## pd.DataFrame.diff()

In [268]:
df = pd.DataFrame({'a': [1, 2, 3, 4, 5, 6],
                   'b': [1, 1, 2, 3, 5, 8],
                   'c': [1, 4, 9, 16, 25, 36]})

df

   a  b   c
0  1  1   1
1  2  1   4
2  3  2   9
3  4  3  16
4  5  5  25
5  6  8  36

In [269]:
df.diff() # difference with previous row

     a    b     c
0  NaN  NaN   NaN
1  1.0  0.0   3.0
2  1.0  1.0   5.0
3  1.0  1.0   7.0
4  1.0  2.0   9.0
5  1.0  3.0  11.0

In [270]:
df.diff(axis = 1) # difference with previous column

    a    b     c
0 NaN  0.0   0.0
1 NaN -1.0   3.0
2 NaN -1.0   7.0
3 NaN -1.0  13.0
4 NaN  0.0  20.0
5 NaN  2.0  28.0

In [271]:
df.diff(periods = 3) # difference with 3rd previous row

     a    b     c
0  NaN  NaN   NaN
1  NaN  NaN   NaN
2  NaN  NaN   NaN
3  3.0  2.0  15.0
4  3.0  4.0  21.0
5  3.0  6.0  27.0

In [272]:
df.diff(periods = -1) # difference with following row

     a    b     c
0 -1.0  0.0  -3.0
1 -1.0 -1.0  -5.0
2 -1.0 -1.0  -7.0
3 -1.0 -2.0  -9.0
4 -1.0 -3.0 -11.0
5  NaN  NaN   NaN

In [273]:
df = pd.DataFrame({"A": [5, 3, 6, 4],
                   "B": [11, 2, 4, 3],
                   "C": [4, 3, 8, 5],
                   "D": [5, 4, 2, 8]})

df

   A   B  C  D
0  5  11  4  5
1  3   2  3  4
2  6   4  8  2
3  4   3  5  8

In [274]:
df.diff(axis = 0, periods = 1)

     A    B    C    D
0  NaN  NaN  NaN  NaN
1 -2.0 -9.0 -1.0 -1.0
2  3.0  2.0  5.0 -2.0
3 -2.0 -1.0 -3.0  6.0

In [275]:
df.diff(axis = 1, periods = 1)

    A    B    C    D
0 NaN  6.0 -7.0  1.0
1 NaN -1.0  1.0  1.0
2 NaN -2.0  4.0 -6.0
3 NaN -1.0  2.0  3.0

## pd.DataFrame.pct_change()

In [276]:
s = pd.Series([90, 91, 85])

s

0    90
1    91
2    85
dtype: int64

In [277]:
s.pct_change()

0         NaN
1    0.011111
2   -0.065934
dtype: float64

In [278]:
s.pct_change(periods = 2)

0         NaN
1         NaN
2   -0.055556
dtype: float64

In [279]:
s = pd.Series([90, 91, None, 85])

s

0    90.0
1    91.0
2     NaN
3    85.0
dtype: float64

In [280]:
s.pct_change(fill_method = 'ffill')

0         NaN
1    0.011111
2         NaN
3   -0.065934
dtype: float64

In [281]:
df = pd.DataFrame({
    'FR': [4.0405, 4.0963, 4.3149],
    'GR': [1.7246, 1.7482, 1.8519],
    'IT': [804.74, 810.01, 860.13]},
 index = ['1980-01-01', '1980-02-01', '1980-03-01'])

df

                FR      GR      IT
1980-01-01  4.0405  1.7246  804.74
1980-02-01  4.0963  1.7482  810.01
1980-03-01  4.3149  1.8519  860.13

In [282]:
df.pct_change()

                  FR        GR        IT
1980-01-01       NaN       NaN       NaN
1980-02-01  0.013810  0.013684  0.006549
1980-03-01  0.053365  0.059318  0.061876

In [283]:
df = pd.DataFrame({
    '2016': [1769950, 30586265],
    '2015': [1500923, 40912316],
    '2014': [1371819, 41403351]},
 index = ['GOOG', 'APPL'])

df

          2014      2015      2016
GOOG   1371819   1500923   1769950
APPL  41403351  40912316  30586265

In [284]:
df.pct_change(axis = 'columns')

      2014      2015      2016
GOOG   NaN  0.094112  0.179241
APPL   NaN -0.011860 -0.252395

In [0]:
ind = pd.date_range('01/01/2000', periods = 6, freq = 'W')

In [286]:
df = pd.DataFrame({"A": [14, 4, 5, 4, 1, 55],
                   "B": [5, 2, 54, 3, 2, 32],
                   "C": [20, 20, 7, 21, 8, 5],
                   "D": [14, 3, 6, 2, 6, 4]}, index = ind)

df

             A   B   C   D
2000-01-02  14   5  20  14
2000-01-09   4   2  20   3
2000-01-16   5  54   7   6
2000-01-23   4   3  21   2
2000-01-30   1   2   8   6
2000-02-06  55  32   5   4

In [287]:
df.pct_change()

                    A          B         C         D
2000-01-02        NaN        NaN       NaN       NaN
2000-01-09  -0.714286  -0.600000  0.000000 -0.785714
2000-01-16   0.250000  26.000000 -0.650000  1.000000
2000-01-23  -0.200000  -0.944444  2.000000 -0.666667
2000-01-30  -0.750000  -0.333333 -0.619048  2.000000
2000-02-06  54.000000  15.000000 -0.375000 -0.333333

In [0]:
ind = pd.date_range('01/01/2000', periods = 6, freq = 'W')

In [289]:
df = pd.DataFrame({"A": [14, 4, 5, 4, 1, 55],
                   "B": [5, 2, None, 3, 2, 32],
                   "C": [20, 20, 7, 21, 8, None],
                   "D": [14, None, 6, 2, 6, 4]}, index = ind)

df

             A     B     C     D
2000-01-02  14   5.0  20.0  14.0
2000-01-09   4   2.0  20.0   NaN
2000-01-16   5   NaN   7.0   6.0
2000-01-23   4   3.0  21.0   2.0
2000-01-30   1   2.0   8.0   6.0
2000-02-06  55  32.0   NaN   4.0

In [290]:
df.pct_change(fill_method = 'ffill')

                    A          B         C         D
2000-01-02        NaN        NaN       NaN       NaN
2000-01-09  -0.714286  -0.600000  0.000000       NaN
2000-01-16   0.250000        NaN -0.650000 -0.571429
2000-01-23  -0.200000   0.500000  2.000000 -0.666667
2000-01-30  -0.750000  -0.333333 -0.619048  2.000000
2000-02-06  54.000000  15.000000       NaN -0.333333

## Correlation and Covariance

In [0]:
import pandas_datareader.data as web

In [0]:
all_data = {ticker: web.get_data_yahoo(ticker)
            for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

In [0]:
price = pd.DataFrame({ticker: data['Adj Close']
                      for ticker, data in all_data.items()})

In [0]:
volume = pd.DataFrame({ticker: data['Volume']
                       for ticker, data in all_data.items()})

In [0]:
returns = price.pct_change()

In [296]:
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2019-02-15 -0.002225 -0.007150  0.011357  0.012348
2019-02-19  0.002993  0.004409  0.004854 -0.000462
2019-02-20  0.006435 -0.004255 -0.005047 -0.005199
2019-02-21 -0.005639 -0.015111 -0.001159  0.021092
2019-02-22  0.011166  0.012215  0.010229  0.014258

In [297]:
returns['MSFT'].corr(returns['IBM'])

0.48644067161677723

In [298]:
returns['MSFT'].cov(returns['IBM'])

8.747076621492922e-05

In [299]:
returns.MSFT.corr(returns.IBM)

0.48644067161677723

In [300]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.457369  0.371674  0.450023
GOOG  0.457369  1.000000  0.408111  0.537457
IBM   0.371674  0.408111  1.000000  0.486441
MSFT  0.450023  0.537457  0.486441  1.000000

In [301]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000271  0.000116  0.000076  0.000108
GOOG  0.000116  0.000239  0.000078  0.000121
IBM   0.000076  0.000078  0.000153  0.000087
MSFT  0.000108  0.000121  0.000087  0.000211

In [302]:
returns.corrwith(returns.IBM)

AAPL    0.371674
GOOG    0.408111
IBM     1.000000
MSFT    0.486441
dtype: float64

In [303]:
returns.corrwith(volume)

AAPL   -0.059934
GOOG   -0.016954
IBM    -0.153665
MSFT   -0.089430
dtype: float64

## Unique Values, Value Counts, and Membership

In [0]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [0]:
uniques = obj.unique()

In [306]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [307]:
uniques.sort()

uniques

array(['a', 'b', 'c', 'd'], dtype=object)

In [308]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [309]:
pd.value_counts(obj.values, sort = False)

c    3
b    2
d    1
a    3
dtype: int64

In [310]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [0]:
mask = obj.isin(['b', 'c'])

In [312]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [313]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [0]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])

In [0]:
unique_vals = pd.Series(['c', 'b', 'a'])

In [316]:
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2])

## pd.DataFrame.isin()

In [317]:
df = pd.DataFrame({'num_legs': [2, 4],
                   'num_wings': [2, 0]},
                  index = ['falcon', 'dog'])

df

        num_legs  num_wings
falcon         2          2
dog            4          0

In [318]:
df.isin([0, 2])

        num_legs  num_wings
falcon      True       True
dog        False       True

In [319]:
df.isin({'num_wings': [0, 3]})

        num_legs  num_wings
falcon     False      False
dog        False       True

In [320]:
other = pd.DataFrame({'num_legs': [8, 2],
                      'num_wings': [0, 2]},
                     index = ['spider', 'falcon'])

other

        num_legs  num_wings
spider         8          0
falcon         2          2

In [321]:
df.isin(other)

        num_legs  num_wings
falcon      True       True
dog        False      False

In [322]:
data = pd.read_csv("https://cdncontribute.geeksforgeeks.org/wp-content/uploads/employees.csv")

data

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
5,Dennis,Male,4/18/1987,1:35 AM,115163,10.125,False,Legal
6,Ruby,Female,8/17/1987,4:20 PM,65476,10.012,True,Product
7,NaN,Female,7/20/2015,10:43 AM,45906,11.598,NaN,Finance
8,Angela,Female,11/22/2005,6:29 AM,95570,18.523,True,Engineering
9,Frances,Female,8/8/2002,6:51 AM,139852,7.524,True,Business Development
10,Louise,Female,8/12/1980,9:01 AM,63241,15.132,True,NaN
11,Julie,Female,10/26/1997,3:19 PM,102508,12.637,True,Legal
12,Brandon,Male,12/1/1980,1:08 AM,112807,17.492,True,Human Resources
13,Gary,Male,1/27/2008,11:40 PM,109831,5.831,False,Sales
14,Kimberly,Female,1/14/1999,7:13 AM,41426,14.543,True,Finance
15,Lillian,Female,6/5/2016,6:09 AM,59414,1.256,False,Product
16,Jeremy,Male,9/21/2010,5:56 AM,90370,7.369,False,Human Resources
17,Shawn,Male,12/7/1986,7:45 PM,111737,6.414,False,Product
18,Diana,Female,10/23/1981,10:27 AM,132940,19.082,False,Client Services
19,Donna,Female,7/22/2010,3:48 AM,81014,1.894,False,Product
20,Lois,NaN,4/22/1995,7:18 PM,64714,4.934,True,Legal
21,Matthew,Male,9/5/1995,2:12 AM,100612,13.645,False,Marketing
22,Joshua,NaN,3/8/2012,1:58 AM,90816,18.816,True,Client Services
23,NaN,Male,6/14/2012,4:19 PM,125792,5.042,NaN,NaN
24,John,Male,7/1/1992,10:08 PM,97950,13.873,False,Client Services
25,NaN,Male,10/8/2012,1:12 AM,37076,18.576,NaN,Client Services
26,Craig,Male,2/27/2000,7:45 AM,37598,7.757,True,Marketing
27,Scott,NaN,7/11/1991,6:58 PM,122367,5.218,False,Legal
28,Terry,Male,11/27/1981,6:30 PM,124008,13.464,True,Client Services
29,Benjamin,Male,1/26/2005,10:06 PM,79529,7.008,True,Legal
...,...,...,...,...,...,...,...,...
970,Alice,Female,9/3/1988,8:54 PM,63571,15.397,True,Product
971,Patrick,Male,12/30/2002,2:01 AM,75423,5.368,True,Business Development
972,Victor,NaN,7/28/2006,2:49 PM,76381,11.159,True,Sales
973,Russell,Male,5/10/2013,11:08 PM,137359,11.105,False,Business Development
974,Harry,Male,8/30/2011,6:31 PM,67656,16.455,True,Client Services
975,Susan,Female,4/7/1995,10:05 PM,92436,12.467,False,Sales
976,Denise,Female,10/19/1992,5:42 AM,137954,4.195,True,Legal
977,Sarah,Female,12/4/1995,9:16 AM,124566,5.949,False,Product
978,Sean,Male,1/17/1983,2:23 PM,66146,11.178,False,Human Resources
979,Ernest,Male,7/20/2013,6:41 AM,142935,13.198,True,Product
980,Kimberly,Female,1/26/2013,12:57 AM,46233,8.862,True,Engineering
981,James,Male,1/15/1993,5:19 PM,148985,19.280,False,Legal
982,Rose,Female,4/6/1982,10:43 AM,91411,8.639,True,Human Resources
983,John,Male,12/23/1982,10:35 PM,146907,11.738,False,Engineering
984,Maria,Female,10/15/2011,4:53 PM,43455,13.040,False,Engineering
985,Stephen,NaN,7/10/1983,8:10 PM,85668,1.909,False,Legal
986,Donna,Female,11/26/1982,7:04 AM,82871,17.999,False,Marketing
987,Gloria,Female,12/8/2014,5:08 AM,136709,10.331,True,Finance
988,Alice,Female,10/5/2004,9:34 AM,47638,11.209,False,Human Resources
989,Justin,NaN,2/10/1991,4:58 PM,38344,3.794,False,Legal
990,Robin,Female,7/24/1987,1:35 PM,100765,10.982,True,Client Services
991,Rose,Female,8/25/2002,5:12 AM,134505,11.051,True,Marketing
992,Anthony,Male,10/16/2011,8:35 AM,112769,11.625,True,Finance
993,Tina,Female,5/15/1997,3:53 PM,56450,19.040,True,Engineering
994,George,Male,6/21/2013,5:47 PM,98874,4.479,True,Marketing
995,Henry,NaN,11/23/2014,6:09 AM,132483,16.655,False,Distribution
996,Phillip,Male,1/31/1984,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,5/20/2013,12:39 PM,96914,1.421,False,Product
998,Larry,Male,4/20/2013,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales

In [0]:
new = data["Gender"].isin(["Male"])

In [324]:
data[new]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
5,Dennis,Male,4/18/1987,1:35 AM,115163,10.125,False,Legal
12,Brandon,Male,12/1/1980,1:08 AM,112807,17.492,True,Human Resources
13,Gary,Male,1/27/2008,11:40 PM,109831,5.831,False,Sales
16,Jeremy,Male,9/21/2010,5:56 AM,90370,7.369,False,Human Resources
17,Shawn,Male,12/7/1986,7:45 PM,111737,6.414,False,Product
21,Matthew,Male,9/5/1995,2:12 AM,100612,13.645,False,Marketing
23,NaN,Male,6/14/2012,4:19 PM,125792,5.042,NaN,NaN
24,John,Male,7/1/1992,10:08 PM,97950,13.873,False,Client Services
25,NaN,Male,10/8/2012,1:12 AM,37076,18.576,NaN,Client Services
26,Craig,Male,2/27/2000,7:45 AM,37598,7.757,True,Marketing
28,Terry,Male,11/27/1981,6:30 PM,124008,13.464,True,Client Services
29,Benjamin,Male,1/26/2005,10:06 PM,79529,7.008,True,Legal
32,NaN,Male,8/21/1998,2:27 PM,122340,6.417,NaN,NaN
34,Jerry,Male,1/10/2004,12:56 PM,95734,19.096,False,Client Services
39,NaN,Male,1/29/2016,2:33 AM,122173,7.797,NaN,Client Services
40,Michael,Male,10/10/2008,11:25 AM,99283,2.665,True,Distribution
45,Roger,Male,4/17/1980,11:32 AM,88010,13.886,True,Sales
46,Bruce,Male,11/28/2009,10:47 PM,114796,6.796,False,Finance
48,Clarence,Male,3/26/1996,5:57 AM,93581,6.083,True,Business Development
52,Todd,Male,2/18/1990,2:41 AM,49339,1.695,True,Human Resources
56,Carl,Male,5/3/2006,5:55 PM,130276,16.084,True,Finance
57,Henry,Male,6/26/1996,1:44 AM,64715,15.107,True,Human Resources
63,Matthew,Male,1/2/2013,10:33 PM,35203,18.040,False,Human Resources
65,Steve,Male,11/11/2009,11:44 PM,61310,12.428,True,Distribution
68,Jose,Male,10/30/2004,1:39 PM,84834,14.330,True,Finance
71,Johnny,Male,11/6/2009,4:23 PM,118172,16.194,True,Sales
...,...,...,...,...,...,...,...,...
931,Harold,Male,6/23/2012,12:40 PM,140444,3.771,False,Distribution
934,Samuel,Male,8/7/1997,12:40 PM,43694,3.787,True,Engineering
940,Andrew,Male,9/28/1990,9:38 AM,137386,8.611,True,Distribution
941,William,Male,6/26/1997,8:33 AM,104840,15.653,True,Engineering
943,Wayne,Male,9/8/2006,11:09 AM,67471,2.728,False,Engineering
944,Kenneth,Male,5/10/2006,8:24 AM,101914,1.905,True,Distribution
947,NaN,Male,7/30/2012,3:07 PM,107351,5.329,NaN,Marketing
949,Scott,Male,8/20/2011,8:08 AM,37385,8.226,True,Business Development
953,Randy,Male,2/25/2012,5:33 AM,57266,14.077,False,Product
954,Joe,Male,1/19/1980,4:06 PM,119667,1.148,True,Finance
957,Jeffrey,Male,2/3/1984,1:26 PM,70990,15.901,True,Sales
959,Albert,Male,9/19/1992,2:35 AM,45094,5.850,True,Business Development
960,Stephen,Male,10/29/1989,11:34 PM,93997,18.093,True,Business Development
962,Jonathan,Male,8/21/2013,12:45 AM,121797,16.923,False,Product
964,Bruce,Male,5/7/1980,8:00 PM,35802,12.391,True,Sales
966,Louis,Male,8/16/2011,5:19 PM,93022,9.146,True,Human Resources
967,Thomas,Male,3/12/2016,3:10 PM,105681,19.572,False,Engineering
971,Patrick,Male,12/30/2002,2:01 AM,75423,5.368,True,Business Development
973,Russell,Male,5/10/2013,11:08 PM,137359,11.105,False,Business Development
974,Harry,Male,8/30/2011,6:31 PM,67656,16.455,True,Client Services
978,Sean,Male,1/17/1983,2:23 PM,66146,11.178,False,Human Resources
979,Ernest,Male,7/20/2013,6:41 AM,142935,13.198,True,Product
981,James,Male,1/15/1993,5:19 PM,148985,19.280,False,Legal
983,John,Male,12/23/1982,10:35 PM,146907,11.738,False,Engineering
992,Anthony,Male,10/16/2011,8:35 AM,112769,11.625,True,Finance
994,George,Male,6/21/2013,5:47 PM,98874,4.479,True,Marketing
996,Phillip,Male,1/31/1984,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,5/20/2013,12:39 PM,96914,1.421,False,Product
998,Larry,Male,4/20/2013,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales

In [0]:
filter1 = data["Gender"].isin(["Female"])

filter2 = data["Team"].isin(["Engineering", "Distribution", "Finance"])

In [326]:
data[filter1 & filter2]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
7,NaN,Female,7/20/2015,10:43 AM,45906,11.598,NaN,Finance
8,Angela,Female,11/22/2005,6:29 AM,95570,18.523,True,Engineering
14,Kimberly,Female,1/14/1999,7:13 AM,41426,14.543,True,Finance
30,Christina,Female,8/6/2002,1:19 PM,118780,9.096,True,Engineering
50,Nancy,Female,9/23/2000,8:05 AM,94976,13.830,True,Engineering
54,Sara,Female,8/15/2007,9:23 AM,83677,8.999,False,Engineering
58,Theresa,Female,4/11/2010,7:18 AM,72670,1.481,True,Engineering
59,Irene,Female,5/7/1997,9:32 AM,66851,11.279,False,Engineering
67,Rachel,Female,8/16/1999,6:53 AM,51178,9.735,True,Finance
76,Margaret,Female,9/10/1988,12:42 PM,131604,7.353,True,Distribution
84,Doris,Female,8/20/2004,5:51 AM,83072,7.511,False,Finance
96,Cynthia,Female,3/21/1994,8:34 AM,142321,1.737,False,Finance
100,Melissa,Female,6/21/2005,6:33 AM,48109,14.995,False,Finance
103,Phyllis,Female,10/11/1996,9:30 PM,136984,8.932,True,Finance
105,Kathy,Female,3/9/1996,4:33 AM,91712,8.567,False,Finance
113,Tina,Female,6/12/2009,7:16 AM,114767,3.711,True,Engineering
122,Christina,Female,4/13/2012,2:04 PM,110169,13.892,True,Engineering
138,Ashley,Female,5/25/2006,11:30 AM,112238,6.030,True,Engineering
142,Elizabeth,Female,10/9/2003,5:53 PM,146129,5.687,False,Finance
149,NaN,Female,8/17/2014,2:00 PM,86230,8.578,NaN,Distribution
160,Kathy,Female,3/18/2000,7:26 PM,149563,16.991,True,Finance
172,Sara,Female,9/23/1991,6:17 PM,97058,9.402,False,Finance
173,Lillian,Female,12/21/2008,6:51 PM,85446,3.959,True,Engineering
179,Jessica,Female,10/23/1995,5:53 AM,68759,19.343,True,Finance
190,Carol,Female,3/19/1996,3:39 AM,57783,9.129,False,Finance
191,Lois,Female,10/18/2013,4:51 PM,36946,6.652,False,Engineering
194,Irene,Female,1/30/2004,8:25 PM,131038,8.996,False,Distribution
209,Emily,Female,9/20/2007,11:25 AM,89434,11.295,False,Engineering
213,Evelyn,Female,5/24/1980,11:10 PM,81673,15.364,True,Engineering
...,...,...,...,...,...,...,...,...
797,Rose,Female,12/31/1982,6:50 PM,145001,19.850,False,Engineering
807,Mary,Female,11/6/2011,8:32 AM,115057,2.089,False,Finance
808,Julie,Female,3/8/1980,5:13 AM,145357,3.459,False,Engineering
814,Rachel,Female,6/23/2011,12:52 AM,54941,3.221,True,Distribution
816,Kelly,Female,3/17/2007,6:20 PM,39371,4.068,False,Engineering
818,Ann,Female,10/3/1980,1:08 AM,96941,10.048,True,Distribution
821,NaN,Female,12/27/1980,2:27 AM,80399,12.254,NaN,Distribution
836,Carolyn,Female,3/17/2004,6:38 AM,118037,13.492,False,Finance
840,Lillian,Female,8/26/2002,8:53 AM,103854,4.924,True,Distribution
875,Beverly,Female,4/11/1998,2:27 PM,76485,9.212,True,Engineering
878,Jacqueline,Female,5/25/2003,7:13 PM,125418,8.064,False,Distribution
884,Lisa,Female,10/17/2003,1:42 PM,73706,18.530,False,Finance
889,Margaret,Female,1/4/2001,3:07 AM,126924,1.552,True,Finance
901,Patricia,Female,10/10/1995,4:52 PM,119266,6.911,False,Distribution
905,Alice,Female,2/9/2013,12:49 AM,121250,4.363,True,Finance
907,Elizabeth,Female,7/27/1998,11:12 AM,137144,10.081,False,Finance
908,Janice,Female,12/17/2009,6:42 AM,102697,3.283,False,Engineering
914,Ann,Female,9/28/2001,6:37 AM,71958,5.272,True,Distribution
926,Judith,Female,3/1/2004,7:32 AM,109324,19.488,False,Distribution
935,Alice,Female,3/23/1996,3:09 AM,131952,12.090,False,Engineering
946,NaN,Female,9/15/1985,1:50 AM,133472,16.941,NaN,Distribution
948,Ashley,Female,3/31/2006,1:24 PM,142410,11.048,True,Engineering
956,Beverly,Female,10/17/1986,12:51 AM,80838,8.115,False,Engineering
958,Gloria,Female,10/24/1987,4:43 AM,39833,9.631,False,Engineering
968,Louise,Female,3/27/1995,10:27 PM,43050,11.671,False,Distribution
969,Linda,Female,2/4/2010,8:49 PM,44486,17.308,True,Engineering
980,Kimberly,Female,1/26/2013,12:57 AM,46233,8.862,True,Engineering
984,Maria,Female,10/15/2011,4:53 PM,43455,13.040,False,Engineering
987,Gloria,Female,12/8/2014,5:08 AM,136709,10.331,True,Finance
993,Tina,Female,5/15/1997,3:53 PM,56450,19.040,True,Engineering

## pd.Index.isin()

In [327]:
idx = pd.Index([1, 2, 3])

idx

Int64Index([1, 2, 3], dtype='int64')

In [328]:
midx = pd.MultiIndex.from_arrays([[1, 2, 3],
                                  ['red', 'blue', 'green']],
                                 names = ('number', 'color'))

midx

MultiIndex(levels=[[1, 2, 3], ['blue', 'green', 'red']],
           labels=[[0, 1, 2], [2, 0, 1]],
           names=['number', 'color'])

In [329]:
midx.isin(['red', 'orange', 'yellow'], level = 'color')

array([ True, False, False])

In [330]:
midx.isin([(1, 'red'), (3, 'red')])

array([ True, False, False])

In [331]:
dates = ['2000-03-11', '2000-03-12', '2000-03-13']

dti = pd.to_datetime(dates)

dti

DatetimeIndex(['2000-03-11', '2000-03-12', '2000-03-13'], dtype='datetime64[ns]', freq=None)

In [332]:
dti.isin(['2000-03-11'])

array([ True, False, False])

In [333]:
idx = pd.Index(['Labrador', 'Beagle', 'Mastiff',
                'Lhasa', 'Husky', 'Beagle'])

idx

Index(['Labrador', 'Beagle', 'Mastiff', 'Lhasa', 'Husky', 'Beagle'], dtype='object')

In [334]:
idx.isin(['Lhasa', 'Mastiff'])

array([False, False,  True,  True, False, False])

In [335]:
midx = pd.MultiIndex.from_arrays([['Mon', 'Tue', 'Wed', 'Thu'],
                                  [10, 20, 30, 40]],
                                 names = ('Days', 'Target'))

midx

MultiIndex(levels=[['Mon', 'Thu', 'Tue', 'Wed'], [10, 20, 30, 40]],
           labels=[[0, 2, 3, 1], [0, 1, 2, 3]],
           names=['Days', 'Target'])

In [336]:
midx.isin(['Tue', 'Wed', 'Fri', 'Sat'], level = 'Days')

array([False,  True,  True, False])

## pd.Series.unique()

In [337]:
pd.Series([2, 1, 3, 3], name = 'A').unique()

array([2, 1, 3])

In [338]:
pd.Series([pd.Timestamp('2016-01-01') for _ in range(3)]).unique()

array(['2016-01-01T00:00:00.000000000'], dtype='datetime64[ns]')

In [339]:
pd.Series([pd.Timestamp('2016-01-01', tz = 'US/Eastern')
           for _ in range(3)]).unique()

array([Timestamp('2016-01-01 00:00:00-0500', tz='US/Eastern')],
      dtype=object)

In [340]:
pd.Series(pd.Categorical(list('baabc'))).unique()

[b, a, c]
Categories (3, object): [b, a, c]

In [341]:
pd.Series(pd.Categorical(list('baabc'), categories = list('abc'),
                         ordered = True)).unique()

[b, a, c]
Categories (3, object): [a < b < c]

In [342]:
data = pd.read_csv("https://cdncontribute.geeksforgeeks.org/wp-content/uploads/employees.csv")

data

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
5,Dennis,Male,4/18/1987,1:35 AM,115163,10.125,False,Legal
6,Ruby,Female,8/17/1987,4:20 PM,65476,10.012,True,Product
7,NaN,Female,7/20/2015,10:43 AM,45906,11.598,NaN,Finance
8,Angela,Female,11/22/2005,6:29 AM,95570,18.523,True,Engineering
9,Frances,Female,8/8/2002,6:51 AM,139852,7.524,True,Business Development
10,Louise,Female,8/12/1980,9:01 AM,63241,15.132,True,NaN
11,Julie,Female,10/26/1997,3:19 PM,102508,12.637,True,Legal
12,Brandon,Male,12/1/1980,1:08 AM,112807,17.492,True,Human Resources
13,Gary,Male,1/27/2008,11:40 PM,109831,5.831,False,Sales
14,Kimberly,Female,1/14/1999,7:13 AM,41426,14.543,True,Finance
15,Lillian,Female,6/5/2016,6:09 AM,59414,1.256,False,Product
16,Jeremy,Male,9/21/2010,5:56 AM,90370,7.369,False,Human Resources
17,Shawn,Male,12/7/1986,7:45 PM,111737,6.414,False,Product
18,Diana,Female,10/23/1981,10:27 AM,132940,19.082,False,Client Services
19,Donna,Female,7/22/2010,3:48 AM,81014,1.894,False,Product
20,Lois,NaN,4/22/1995,7:18 PM,64714,4.934,True,Legal
21,Matthew,Male,9/5/1995,2:12 AM,100612,13.645,False,Marketing
22,Joshua,NaN,3/8/2012,1:58 AM,90816,18.816,True,Client Services
23,NaN,Male,6/14/2012,4:19 PM,125792,5.042,NaN,NaN
24,John,Male,7/1/1992,10:08 PM,97950,13.873,False,Client Services
25,NaN,Male,10/8/2012,1:12 AM,37076,18.576,NaN,Client Services
26,Craig,Male,2/27/2000,7:45 AM,37598,7.757,True,Marketing
27,Scott,NaN,7/11/1991,6:58 PM,122367,5.218,False,Legal
28,Terry,Male,11/27/1981,6:30 PM,124008,13.464,True,Client Services
29,Benjamin,Male,1/26/2005,10:06 PM,79529,7.008,True,Legal
...,...,...,...,...,...,...,...,...
970,Alice,Female,9/3/1988,8:54 PM,63571,15.397,True,Product
971,Patrick,Male,12/30/2002,2:01 AM,75423,5.368,True,Business Development
972,Victor,NaN,7/28/2006,2:49 PM,76381,11.159,True,Sales
973,Russell,Male,5/10/2013,11:08 PM,137359,11.105,False,Business Development
974,Harry,Male,8/30/2011,6:31 PM,67656,16.455,True,Client Services
975,Susan,Female,4/7/1995,10:05 PM,92436,12.467,False,Sales
976,Denise,Female,10/19/1992,5:42 AM,137954,4.195,True,Legal
977,Sarah,Female,12/4/1995,9:16 AM,124566,5.949,False,Product
978,Sean,Male,1/17/1983,2:23 PM,66146,11.178,False,Human Resources
979,Ernest,Male,7/20/2013,6:41 AM,142935,13.198,True,Product
980,Kimberly,Female,1/26/2013,12:57 AM,46233,8.862,True,Engineering
981,James,Male,1/15/1993,5:19 PM,148985,19.280,False,Legal
982,Rose,Female,4/6/1982,10:43 AM,91411,8.639,True,Human Resources
983,John,Male,12/23/1982,10:35 PM,146907,11.738,False,Engineering
984,Maria,Female,10/15/2011,4:53 PM,43455,13.040,False,Engineering
985,Stephen,NaN,7/10/1983,8:10 PM,85668,1.909,False,Legal
986,Donna,Female,11/26/1982,7:04 AM,82871,17.999,False,Marketing
987,Gloria,Female,12/8/2014,5:08 AM,136709,10.331,True,Finance
988,Alice,Female,10/5/2004,9:34 AM,47638,11.209,False,Human Resources
989,Justin,NaN,2/10/1991,4:58 PM,38344,3.794,False,Legal
990,Robin,Female,7/24/1987,1:35 PM,100765,10.982,True,Client Services
991,Rose,Female,8/25/2002,5:12 AM,134505,11.051,True,Marketing
992,Anthony,Male,10/16/2011,8:35 AM,112769,11.625,True,Finance
993,Tina,Female,5/15/1997,3:53 PM,56450,19.040,True,Engineering
994,George,Male,6/21/2013,5:47 PM,98874,4.479,True,Marketing
995,Henry,NaN,11/23/2014,6:09 AM,132483,16.655,False,Distribution
996,Phillip,Male,1/31/1984,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,5/20/2013,12:39 PM,96914,1.421,False,Product
998,Larry,Male,4/20/2013,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales

In [343]:
arr = data["Team"].unique()

arr

array(['Marketing', nan, 'Finance', 'Client Services', 'Legal', 'Product',
       'Engineering', 'Business Development', 'Human Resources', 'Sales',
       'Distribution'], dtype=object)

## pd.Series.value_counts()

In [0]:
index = pd.Index([3, 1, 2, 3, 4, np.nan])

In [345]:
index.value_counts()

3.0    2
4.0    1
2.0    1
1.0    1
dtype: int64

In [0]:
s = pd.Series([3, 1, 2, 3, 4, np.nan])

In [347]:
s.value_counts(normalize = True)

3.0    0.4
4.0    0.2
2.0    0.2
1.0    0.2
dtype: float64

In [348]:
s.value_counts(bins = 3)

(2.0, 3.0]      2
(0.996, 2.0]    2
(3.0, 4.0]      1
dtype: int64

In [349]:
s.value_counts(dropna = False)

 3.0    2
NaN     1
 4.0    1
 2.0    1
 1.0    1
dtype: int64

In [350]:
sr = pd.Series(['New York', 'Chicago', 'Toronto', 'Lisbon', 'Rio',
                'Chicago', 'Lisbon'])

sr

0    New York
1     Chicago
2     Toronto
3      Lisbon
4         Rio
5     Chicago
6      Lisbon
dtype: object

In [351]:
sr.value_counts()

Chicago     2
Lisbon      2
New York    1
Rio         1
Toronto     1
dtype: int64

In [352]:
sr = pd.Series([100, 214, 325, 88, None, 325, None, 325, 100])

sr

0    100.0
1    214.0
2    325.0
3     88.0
4      NaN
5    325.0
6      NaN
7    325.0
8    100.0
dtype: float64

In [353]:
sr.value_counts()

325.0    3
100.0    2
88.0     1
214.0    1
dtype: int64

## pd.Index.value_counts()

In [354]:
index = pd.Index([3, 1, 2, 3, 4, np.nan])

index.value_counts()

3.0    2
4.0    1
2.0    1
1.0    1
dtype: int64

In [355]:
s = pd.Series([3, 1, 2, 3, 4, np.nan])

s.value_counts(normalize = True)

3.0    0.4
4.0    0.2
2.0    0.2
1.0    0.2
dtype: float64

In [356]:
s.value_counts(bins = 3)

(2.0, 3.0]      2
(0.996, 2.0]    2
(3.0, 4.0]      1
dtype: int64

In [357]:
s.value_counts(dropna = False)

 3.0    2
NaN     1
 4.0    1
 2.0    1
 1.0    1
dtype: int64

In [358]:
idx = pd.Index(['Harry', 'Mike', 'Arthur', 'Nick', 'Harry',
                'Arthur'], name = 'Student')

idx

Index(['Harry', 'Mike', 'Arthur', 'Nick', 'Harry', 'Arthur'], dtype='object', name='Student')

In [359]:
idx.value_counts()

Arthur    2
Harry     2
Mike      1
Nick      1
Name: Student, dtype: int64

In [360]:
idx = pd.Index([21, 10, 30, 40, 50, 10, 50])

idx

Int64Index([21, 10, 30, 40, 50, 10, 50], dtype='int64')

In [361]:
idx.value_counts()

10    2
50    2
30    1
21    1
40    1
dtype: int64

## Back to book content

In [362]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                     'Qu2': [2, 3, 1, 2, 3],
                     'Qu3': [1, 5, 2, 4, 4]})

data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [363]:
result = data.apply(pd.value_counts).fillna(0)

result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0